<a href="https://colab.research.google.com/github/Ed00107/sbd1/blob/main/%D0%9D%D0%BE%D1%83%D1%82%D0%B1%D1%83%D0%BA_%D0%BA_%D0%B7%D0%B0%D0%BD%D1%8F%D1%82%D0%B8%D1%8E_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Занятие 1

**СУБД** — система управления базами данных. 

Сначала установим специальную библиотеку-коннектор для подключения к удаленной базе данных. Для PostgreSQL эта библиотека называется psycopg2. Для других СУБД будут уже другие библиотеки, но со схожим интерфейсом (например, для MySQL можно использовать библиотеку pymysql).

In [ ]:
!pip install psycopg2

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: psycopg2 in /usr/local/lib/python3.7/dist-packages (2.9.5)

Ниже данные для подключения к удаленной базе данных. Мы указываем


1.   ip адрес сервера
2.   Имя пользователя (в СУБД)
3.   Пароль пользователя
4.   Имя базы данных на сервере к которой мы подключаемся

В рамках этого курса на удаленном сервере уже создано все необходимое для пользователей с названиями student_0, student_1, ... , student_9. Пароль совпадает с именем пользователя.

*Картинка с общим описанием того, что происходит:*

![](https://drive.google.com/uc?export=view&id=1zSoMrnLwKTNTlsZA0BCRUcBjVhjBPwXN)

In [ ]:
import psycopg2
import pandas as pd
import json

DB_HOST = 'de-edu-db.chronosavant.ru'
DB_USER = 'da11'
DB_USER_PASSWORD = 'gandalfthegrey'
DB_NAME = 'edu'

Схема учебной базы данных King's Corporation

![](https://drive.google.com/uc?export=view&id=1Bx3NlfuBk5s1fOCQqDtvz-fh2Z8OANVL)

Для начала, создадим объект соединения с базой данных, который будет хранить нашу текущую сессию и авторизационные данные. Без этого мы не сможем делать запросы к удаленному серверу.

In [ ]:
conn = psycopg2.connect(host=DB_HOST, user=DB_USER, password=DB_USER_PASSWORD, dbname=DB_NAME)
conn

### Убедительная просьба
При работе над домашним заданием, а также в работе в дальнейшем не пренебрегать использованием так называемых sql formatter-ов, которые приведут ваш длинный запрос в более читабельный вид. 

Можно пользоваться, например, одним из этих:
1. https://sqlformat.org/
2. https://www.freeformatter.com/sql-formatter.html
3. http://www.dpriver.com/pp/sqlformat.htm

# SELECT
Самый частый запрос к базе данных, конечно, как правило на выборку данных. Поэтому очень важно освоить базовые навыки. В этой части мы с вами рассмотрим простейшие запросы к таблицам учебной базы King's Corporation (sample_db).

Полный синтаксис запроса SELECT в postgresql можно найти [здесь](https://postgrespro.ru/docs/postgrespro/9.6/sql-select)

Итак первый простейший запрос на выборку. Мы пользуемся специальной функцией pandas, которая отправляет запрос на удаленный сервер, и инициализирует ответ от сервера как уже привычный нам pandas DataFrame. Мы могли бы направлять наши запросы напрямую с помощью psycopg2, тогда нам бы вернулся массив кортежей, которые мы могли бы уже самостоятельно обработать как нам нужно, но в данной ситуации метод read_sql_query для нас более удобен. Обратите внимание, что вторым параметром нужно передать объект, хранящий информацию о нашем текущем соединении с базой данных.

SQL удобен тем, что запросы можно проговаривать в голове.

В данном случае это будет звучать как: "ВЗЯТЬ ВСЕ КОЛОНКИ ИЗ ТАБЛИЦЫ employee". 

Т.е * означает все колонки.

Часть между ключевыми словами SELECT и FROM называют **проекцией**.

In [ ]:
pd.read_sql_query("SELECT * FROM da.employee", conn)

,employee_id,last_name,first_name,middle_initial,manager_id,job_id,hire_date,salary,commission,department_id
0,7369,SMITH,JOHN,Q,7902.0,667,1984-12-17,800.0,NaN,20
1,7499,ALLEN,KEVIN,J,7698.0,670,1985-02-20,1600.0,300.0,30
2,7505,DOYLE,JEAN,K,7839.0,671,1985-04-04,2850.0,NaN,13
3,7506,DENNIS,LYNN,S,7839.0,671,1985-05-15,2750.0,NaN,23
4,7507,BAKER,LESLIE,D,7839.0,671,1985-06-10,2200.0,NaN,14
5,7521,WARD,CYNTHIA,D,7698.0,670,1985-02-22,1250.0,500.0,30
6,7555,PETERS,DANIEL,T,7505.0,670,1985-03-31,1250.0,300.0,13
7,7557,SHAW,KAREN,P,7505.0,670,1985-04-02,1250.0,1200.0,13
8,7560,DUNCAN,SARAH,S,7506.0,670,1985-05-31,1250.0,NaN,23
9,7564,LANGE,GREGORY,J,7506.0,670,1985-06-01,1250.0,300.0,23
10,7566,JONES,TERRY,M,7839.0,671,1985-04-02,2975.0,NaN,20
11,7569,ALBERTS,CHRIS,L,7839.0,671,1985-04-06,3000.0,NaN,12
12,7600,PORTER,RAYMOND,Y,7505.0,670,1985-04-15,1250.0,900.0,13
13,7609,LEWIS,RICHARD,M,7507.0,668,1985-04-16,1800.0,NaN,24
14,7654,MARTIN,KENNETH,J,7698.0,670,1985-09-28,1250.0,1400.0,30
15,7676,SOMMERS,DENISE,D,7507.0,668,1985-04-19,1850.0,NaN,34
16,7698,BLAKE,MARION,S,7839.0,671,1985-05-01,2850.0,NaN,30
17,7782,CLARK,CAROL,F,7839.0,671,1985-06-09,2450.0,NaN,10
18,7788,SCOTT,DONALD,T,7566.0,669,1986-12-09,3000.0,NaN,20
19,7789,WEST,LIVIA,N,7506.0,670,1985-04-04,1500.0,1000.0,23
20,7799,FISHER,MATTHEW,G,7569.0,669,1986-12-12,3000.0,NaN,12
21,7820,ROSS,PAUL,S,7505.0,670,1985-06-01,1300.0,800.0,43
22,7839,KING,FRANCIS,A,NaN,672,1985-11-17,5000.0,NaN,10
23,7844,TURNER,MARY,A,7698.0,670,1985-09-08,1500.0,0.0,30
24,7876,ADAMS,DIANE,G,7788.0,667,1987-01-12,1100.0,NaN,20
25,7900,JAMES,FRED,S,7698.0,667,1985-12-03,950.0,NaN,30
26,7902,FORD,JENNIFER,D,7566.0,669,1985-12-03,3000.0,NaN,20
27,7916,ROBERTS,GRACE,M,7569.0,669,1987-01-04,2875.0,NaN,12
28,7919,DOUGLAS,MICHAEL,A,7799.0,667,1987-01-04,800.0,NaN,12
29,7934,MILLER,BARBARA,M,7782.0,667,1986-01-23,1300.0,NaN,10
30,7950,JENSEN,ALICE,B,7505.0,667,1987-01-15,750.0,NaN,13
31,7954,MURRAY,JAMES,T,7506.0,667,1987-01-16,750.0,NaN,23

С помощью инструкции WHERE мы можем отфильтровать значения. Внутри доступны любые [логические операции, а также вызов функций](https://www.postgresqltutorial.com/postgresql-where/). Выберем только те записи в которых зарплата (salary) > 1000.

In [ ]:
pd.read_sql_query("""
SELECT * 
FROM   da.employee 
WHERE  salary > 1000 
""",conn)

,employee_id,last_name,first_name,middle_initial,manager_id,job_id,hire_date,salary,commission,department_id
0,7499,ALLEN,KEVIN,J,7698.0,670,1985-02-20,1600.0,300.0,30
1,7505,DOYLE,JEAN,K,7839.0,671,1985-04-04,2850.0,NaN,13
2,7506,DENNIS,LYNN,S,7839.0,671,1985-05-15,2750.0,NaN,23
3,7507,BAKER,LESLIE,D,7839.0,671,1985-06-10,2200.0,NaN,14
4,7521,WARD,CYNTHIA,D,7698.0,670,1985-02-22,1250.0,500.0,30
5,7555,PETERS,DANIEL,T,7505.0,670,1985-03-31,1250.0,300.0,13
6,7557,SHAW,KAREN,P,7505.0,670,1985-04-02,1250.0,1200.0,13
7,7560,DUNCAN,SARAH,S,7506.0,670,1985-05-31,1250.0,NaN,23
8,7564,LANGE,GREGORY,J,7506.0,670,1985-06-01,1250.0,300.0,23
9,7566,JONES,TERRY,M,7839.0,671,1985-04-02,2975.0,NaN,20
10,7569,ALBERTS,CHRIS,L,7839.0,671,1985-04-06,3000.0,NaN,12
11,7600,PORTER,RAYMOND,Y,7505.0,670,1985-04-15,1250.0,900.0,13
12,7609,LEWIS,RICHARD,M,7507.0,668,1985-04-16,1800.0,NaN,24
13,7654,MARTIN,KENNETH,J,7698.0,670,1985-09-28,1250.0,1400.0,30
14,7676,SOMMERS,DENISE,D,7507.0,668,1985-04-19,1850.0,NaN,34
15,7698,BLAKE,MARION,S,7839.0,671,1985-05-01,2850.0,NaN,30
16,7782,CLARK,CAROL,F,7839.0,671,1985-06-09,2450.0,NaN,10
17,7788,SCOTT,DONALD,T,7566.0,669,1986-12-09,3000.0,NaN,20
18,7789,WEST,LIVIA,N,7506.0,670,1985-04-04,1500.0,1000.0,23
19,7799,FISHER,MATTHEW,G,7569.0,669,1986-12-12,3000.0,NaN,12
20,7820,ROSS,PAUL,S,7505.0,670,1985-06-01,1300.0,800.0,43
21,7839,KING,FRANCIS,A,NaN,672,1985-11-17,5000.0,NaN,10
22,7844,TURNER,MARY,A,7698.0,670,1985-09-08,1500.0,0.0,30
23,7876,ADAMS,DIANE,G,7788.0,667,1987-01-12,1100.0,NaN,20
24,7902,FORD,JENNIFER,D,7566.0,669,1985-12-03,3000.0,NaN,20
25,7916,ROBERTS,GRACE,M,7569.0,669,1987-01-04,2875.0,NaN,12
26,7934,MILLER,BARBARA,M,7782.0,667,1986-01-23,1300.0,NaN,10

Условие может быть и более сложным, например

In [ ]:
pd.read_sql_query("""
SELECT * 
FROM   da.employee 
WHERE  ( salary > 1000 ) 
       AND ( department_id = 30 ) 
""",conn)

   employee_id last_name first_name  ...  salary  commission  department_id
0         7499     allen      kevin  ...  1600.0       300.0             30
1         7521      ward    cynthia  ...  1250.0       500.0             30
2         7654    martin    kenneth  ...  1250.0      1400.0             30
3         7698     blake     marion  ...  2850.0         NaN             30
4         7844    turner       mary  ...  1500.0         0.0             30

[5 rows x 10 columns]

AND - логическое И
OR - логическое ИЛИ
доступны операции сравнения >,<, =, != (<>)

Скобками мы можем задавать приоритет операций, рекомендую так делать даже если понятно в каком порядке будет происходить выполнение, так вы на 100% сможете быть уверены в том, что будет выведено то, что вы и имели ввиду.

In [ ]:
pd.read_sql_query("""
SELECT employee_id, 
       last_name, 
       department_id, 
       salary 
FROM   da.employee 
WHERE  ( department_id = 30 ) 
       AND ( salary >= 800 
             AND salary <= 1000 ) 
""",conn)

   employee_id last_name  department_id  salary
0         7900     james             30   950.0

Предположим, что нам надо вывести людей с зарплатой в каком-то диапазоне. Для этого есть 2 варианта

In [ ]:
# вар 1
pd.read_sql_query("""
SELECT * 
FROM   da.employee 
WHERE  salary >= 1000 
       AND salary <= 1500 
""",conn)

    employee_id last_name first_name  ...  salary  commission  department_id
0          7521      ward    cynthia  ...  1250.0       500.0             30
1          7555    peters     daniel  ...  1250.0       300.0             13
2          7557      shaw      karen  ...  1250.0      1200.0             13
3          7560    duncan      sarah  ...  1250.0         NaN             23
4          7564     lange    gregory  ...  1250.0       300.0             23
5          7600    porter    raymond  ...  1250.0       900.0             13
6          7654    martin    kenneth  ...  1250.0      1400.0             30
7          7789      west      livia  ...  1500.0      1000.0             23
8          7820      ross       paul  ...  1300.0       800.0             43
9          7844    turner       mary  ...  1500.0         0.0             30
10         7876     adams      diane  ...  1100.0         NaN             20
11         7934    miller    barbara  ...  1300.0         NaN             10

[12 rows x 10 columns]

Но мы можем использовать инструкцию BETWEEN ... AND ... вместо явного указания знаками. Получается, это что-то вроде синтаксического сахара.

In [ ]:
# вар 2
pd.read_sql_query("""
SELECT * 
FROM   da.employee 
WHERE  salary BETWEEN 1000 AND 1500 
""",conn)

    employee_id last_name first_name  ...  salary  commission  department_id
0          7521      ward    cynthia  ...  1250.0       500.0             30
1          7555    peters     daniel  ...  1250.0       300.0             13
2          7557      shaw      karen  ...  1250.0      1200.0             13
3          7560    duncan      sarah  ...  1250.0         NaN             23
4          7564     lange    gregory  ...  1250.0       300.0             23
5          7600    porter    raymond  ...  1250.0       900.0             13
6          7654    martin    kenneth  ...  1250.0      1400.0             30
7          7789      west      livia  ...  1500.0      1000.0             23
8          7820      ross       paul  ...  1300.0       800.0             43
9          7844    turner       mary  ...  1500.0         0.0             30
10         7876     adams      diane  ...  1100.0         NaN             20
11         7934    miller    barbara  ...  1300.0         NaN             10

[12 rows x 10 columns]

У нас также может возникнуть задача поиска в каком-то ограниченном списке значений. Для такой задачи также есть 2 варианта.

In [ ]:
# вар 1.
pd.read_sql_query("""
SELECT * 
FROM   da.employee 
WHERE  first_name = 'cynthia' 
        OR first_name = 'gregory' 
        OR first_name = 'kenneth' 
""",conn)

   employee_id last_name first_name  ...  salary  commission  department_id
0         7521      ward    cynthia  ...  1250.0       500.0             30
1         7564     lange    gregory  ...  1250.0       300.0             23
2         7654    martin    kenneth  ...  1250.0      1400.0             30

[3 rows x 10 columns]

Или, используя встроенную конструкцию IN, сделаем этот запрос покороче.

In [ ]:
# вар 2.
pd.read_sql_query("""
SELECT * 
FROM   da.employee 
WHERE  first_name IN ( 'cynthia', 'gregory', 'kenneth' ) 
""",conn)

Мы также можем переименовывать колонки в проекции, и рассматриваемые таблицы в момент запроса с помощью элиасов (псевдонимов). Так мы выведем колонки employee_id и last_name у всех записей в которых job_id = 667

In [ ]:
pd.read_sql_query("""
SELECT employee_id, 
       last_name AS "фамилия" 
FROM   da.employee AS t1 
WHERE  t1.job_id = 667 
    """, conn)

   employee_id  фамилия
0         7369    smith
1         7876    adams
2         7900    james
3         7919  douglas
4         7934   miller
5         7950   jensen
6         7954   murray

Мы можем указать порядок сортировки наших объектов с помощью конструкции ORDER BY. Она принимает набор колонок (или функций от колонок) с указанием типа сортировки (по умолчанию по возрастанию ASC - ascending, а также по убыванию DESC - descending). Через запятую можно указать сразу несколько таких колонок.

In [ ]:
pd.read_sql_query("""
SELECT employee_id, 
       last_name, 
       department_id, 
       salary 
FROM   da.employee 
WHERE  ( salary >= 800 
         AND salary <= 1000 ) 
ORDER  BY salary DESC 
""",conn)

   employee_id last_name  department_id  salary
0         7900     james             30   950.0
1         7369     smith             20   800.0
2         7919   douglas             12   800.0

Можно сортировать по нескольким полям сразу

In [ ]:
pd.read_sql_query("""
SELECT employee_id, 
       last_name, 
       department_id, 
       salary 
FROM   da.employee 
WHERE   ( salary >= 800 
         AND salary <= 2000 )
      --   salary between 800 and 2000
ORDER  BY salary DESC, 
          employee_id ASC 
""",conn)

    employee_id last_name  department_id  salary
0          7676   SOMMERS             34  1850.0
1          7609     LEWIS             24  1800.0
2          7499     ALLEN             30  1600.0
3          7789      WEST             23  1500.0
4          7844    TURNER             30  1500.0
5          7820      ROSS             43  1300.0
6          7934    MILLER             10  1300.0
7          7521      WARD             30  1250.0
8          7555    PETERS             13  1250.0
9          7557      SHAW             13  1250.0
10         7560    DUNCAN             23  1250.0
11         7564     LANGE             23  1250.0
12         7600    PORTER             13  1250.0
13         7654    MARTIN             30  1250.0
14         7876     ADAMS             20  1100.0
15         7900     JAMES             30   950.0
16         7369     SMITH             20   800.0
17         7919   DOUGLAS             12   800.0

Инструкция DISTINCT выведет только уникальные строки, и операция применяется ко всей проекции (для всех колонок объекта в результате).

In [ ]:
pd.read_sql_query("""
SELECT DISTINCT 
  department_id , manager_id
FROM   da.employee 
ORDER  BY department_id
           
""", conn)

    department_id  manager_id
0              10      7782.0
1              10      7839.0
2              10         NaN
3              12      7569.0
4              12      7839.0
5              12      7799.0
6              13      7839.0
7              13      7505.0
8              14      7839.0
9              20      7839.0
10             20      7902.0
11             20      7788.0
12             20      7566.0
13             23      7839.0
14             23      7506.0
15             24      7507.0
16             30      7839.0
17             30      7698.0
18             34      7507.0
19             43      7505.0

Очень удобна конструкция LIKE для фильтрации по строкам. 

Синтаксис этой конструкции см. в презентации на слайде 17.

In [ ]:
pd.read_sql_query("""
SELECT last_name 
FROM   da.employee 
WHERE  upper(last_name) LIKE upper('___e%')
""", conn)

  last_name
0     ALLEN
1     BAKER
2    PETERS
3     JONES
4   ALBERTS
5     JAMES
6   ROBERTS

Кроме того, мы можем группировать объекты по значениям колонок и подсчитывать агрегационные функции. Например, посчитаем часто встречающиеся метрики по зарплате в группировке по департаментам.

обычно в любой СУБД доступны следующие агрегационные функции:
* COUNT количество
* AVG среднее
* MAX максимум
* MIN минимум
* SUM сумма

Обратите внимание, что при группировке, каждая группа "схлопывается/аггрегируется" в одно значение. А значит все поля, участвующие в группировке должны присутствовать в проекции, иначе вы увидите ошибку.

In [ ]:
pd.read_sql_query("""
SELECT --salary, department_id
department_id, 
       Avg(salary)   AS avg_salary, 
       Max(salary)   AS max_salary, 
       Min(salary)   AS min_salary, 
       Sum(salary)   AS sum_salary, 
       Count(salary) AS cnt_salary,
        Count(distinct salary) AS cnt_uniq_salary 
FROM  da.employee 
GROUP  BY department_id 
order by department_id desc
""", conn)

,department_id,avg_salary,max_salary,min_salary,sum_salary,cnt_salary,cnt_uniq_salary
0,43,1300.000000,1300.0,1300.0,1300.0,1,1
1,34,1850.000000,1850.0,1850.0,1850.0,1,1
2,30,1566.666667,2850.0,950.0,9400.0,6,5
3,24,1800.000000,1800.0,1800.0,1800.0,1,1
4,23,1500.000000,2750.0,750.0,7500.0,5,4
5,20,2175.000000,3000.0,800.0,10875.0,5,4
6,14,2200.000000,2200.0,2200.0,2200.0,1,1
7,13,1470.000000,2850.0,750.0,7350.0,5,3
8,12,2418.750000,3000.0,800.0,9675.0,4,3
9,10,2916.666667,5000.0,1300.0,8750.0,3,3

Конструкция HAVING позволяет нам делать дополнительную фильтрацию после основного запроса с группировкой. Например, мы можем сначала посчитать среднюю зарплату для каждого отдела, а потом отдельно указать, что нам нужны только те отделы в которых средняя зарплата больше 1000.

In [ ]:
pd.read_sql_query("""
SELECT department_id, 
       Avg(salary) AS avg_salary 
FROM  da.employee
GROUP  BY department_id 
HAVING Avg(salary) > 1500 
limit 0
""", conn)

Empty DataFrame
Columns: [department_id, avg_salary]
Index: []

Для того чтобы посмотреть набор таблиц, имеющихся в базе данных, нужно сделать запрос к системной базе данных и соответствующим системным таблицам, которые хранят метаданные о структурах, создаваемых пользователями в СУБД (это просто запрос из гугла).

In [ ]:
pd.read_sql_query("""
SELECT * 
FROM   pg_catalog.pg_tables 
WHERE  schemaname != 'pg_catalog' 
       AND schemaname != 'information_schema' 
""", conn)

  schemaname    tablename tableowner  ... hasrules  hastriggers  rowsecurity
0     public          job   postgres  ...    False         True        False
1     public      product   postgres  ...    False         True        False
2     public        price   postgres  ...    False         True        False
3     public         item   postgres  ...    False         True        False
4     public  sales_order   postgres  ...    False         True        False
5     public     employee   postgres  ...    False         True        False
6     public     location   postgres  ...    False         True        False
7     public     customer   postgres  ...    False         True        False
8     public   department   postgres  ...    False         True        False

[9 rows x 8 columns]

Порядок выполнения операций следующий:

SELECT -> FROM -> WHERE -> GROUP BY -> HAVING -> ORDER BY -> LIMIT

LIMIT n ограничивает выборку n строчками.

# NULL


1.   NULL ~ можно интерпретировать как "неизвестно"/"отсутствует"/"неопределенность", но никак не как 0
2.   NULL = NULL -> False
3.   Нельзя сравнивать столбец с NULL. Т.е. нельзя писать такое: phone_number != NULL или credit_limit = NULL.
4.   Надо так: credit_limit IS NULL/ credit_limit IS NOT NULL.
5.   Если мы указываем в агрегатных функциях конкретный столбец для подсчёта, то NULL игнорируется. Так, например, SELECT COUNT(manager_id), посчитает все строки в которых manager_id IS NOT NULL, а вот такое выражение SELECT COUNT(*) посчитает и те строки в которых есть столбцы со значением IS NULL.
6.   NULL +/-* число -> NULL

In [ ]:
pd.read_sql_query("""
SELECT * 
FROM   da.employee 
WHERE  1 = 1 
""", conn) # 1=1 всегда вычисляется в TRUE, поэтому...
# появится вся таблица

# None, np.nan --> это скорее всего NULL в выводе SQL сервера
# NULL в строковых колонках преобразуется pandas-ом в None
# NULL в числовых колонках преобразуется pandas-ом в np.nan

,employee_id,last_name,first_name,middle_initial,manager_id,job_id,hire_date,salary,commission,department_id
0,7369,SMITH,JOHN,Q,7902.0,667,1984-12-17,800.0,NaN,20
1,7499,ALLEN,KEVIN,J,7698.0,670,1985-02-20,1600.0,300.0,30
2,7505,DOYLE,JEAN,K,7839.0,671,1985-04-04,2850.0,NaN,13
3,7506,DENNIS,LYNN,S,7839.0,671,1985-05-15,2750.0,NaN,23
4,7507,BAKER,LESLIE,D,7839.0,671,1985-06-10,2200.0,NaN,14
5,7521,WARD,CYNTHIA,D,7698.0,670,1985-02-22,1250.0,500.0,30
6,7555,PETERS,DANIEL,T,7505.0,670,1985-03-31,1250.0,300.0,13
7,7557,SHAW,KAREN,P,7505.0,670,1985-04-02,1250.0,1200.0,13
8,7560,DUNCAN,SARAH,S,7506.0,670,1985-05-31,1250.0,NaN,23
9,7564,LANGE,GREGORY,J,7506.0,670,1985-06-01,1250.0,300.0,23
10,7566,JONES,TERRY,M,7839.0,671,1985-04-02,2975.0,NaN,20
11,7569,ALBERTS,CHRIS,L,7839.0,671,1985-04-06,3000.0,NaN,12
12,7600,PORTER,RAYMOND,Y,7505.0,670,1985-04-15,1250.0,900.0,13
13,7609,LEWIS,RICHARD,M,7507.0,668,1985-04-16,1800.0,NaN,24
14,7654,MARTIN,KENNETH,J,7698.0,670,1985-09-28,1250.0,1400.0,30
15,7676,SOMMERS,DENISE,D,7507.0,668,1985-04-19,1850.0,NaN,34
16,7698,BLAKE,MARION,S,7839.0,671,1985-05-01,2850.0,NaN,30
17,7782,CLARK,CAROL,F,7839.0,671,1985-06-09,2450.0,NaN,10
18,7788,SCOTT,DONALD,T,7566.0,669,1986-12-09,3000.0,NaN,20
19,7789,WEST,LIVIA,N,7506.0,670,1985-04-04,1500.0,1000.0,23
20,7799,FISHER,MATTHEW,G,7569.0,669,1986-12-12,3000.0,NaN,12
21,7820,ROSS,PAUL,S,7505.0,670,1985-06-01,1300.0,800.0,43
22,7839,KING,FRANCIS,A,NaN,672,1985-11-17,5000.0,NaN,10
23,7844,TURNER,MARY,A,7698.0,670,1985-09-08,1500.0,0.0,30
24,7876,ADAMS,DIANE,G,7788.0,667,1987-01-12,1100.0,NaN,20
25,7900,JAMES,FRED,S,7698.0,667,1985-12-03,950.0,NaN,30
26,7902,FORD,JENNIFER,D,7566.0,669,1985-12-03,3000.0,NaN,20
27,7916,ROBERTS,GRACE,M,7569.0,669,1987-01-04,2875.0,NaN,12
28,7919,DOUGLAS,MICHAEL,A,7799.0,667,1987-01-04,800.0,NaN,12
29,7934,MILLER,BARBARA,M,7782.0,667,1986-01-23,1300.0,NaN,10
30,7950,JENSEN,ALICE,B,7505.0,667,1987-01-15,750.0,NaN,13
31,7954,MURRAY,JAMES,T,7506.0,667,1987-01-16,750.0,NaN,23

In [ ]:
pd.read_sql_query("SELECT * FROM da.employee WHERE NULL is NULL", conn) # NULL = NULL -> False

,employee_id,last_name,first_name,middle_initial,manager_id,job_id,hire_date,salary,commission,department_id
0,7369,SMITH,JOHN,Q,7902.0,667,1984-12-17,800.0,NaN,20
1,7499,ALLEN,KEVIN,J,7698.0,670,1985-02-20,1600.0,300.0,30
2,7505,DOYLE,JEAN,K,7839.0,671,1985-04-04,2850.0,NaN,13
3,7506,DENNIS,LYNN,S,7839.0,671,1985-05-15,2750.0,NaN,23
4,7507,BAKER,LESLIE,D,7839.0,671,1985-06-10,2200.0,NaN,14
5,7521,WARD,CYNTHIA,D,7698.0,670,1985-02-22,1250.0,500.0,30
6,7555,PETERS,DANIEL,T,7505.0,670,1985-03-31,1250.0,300.0,13
7,7557,SHAW,KAREN,P,7505.0,670,1985-04-02,1250.0,1200.0,13
8,7560,DUNCAN,SARAH,S,7506.0,670,1985-05-31,1250.0,NaN,23
9,7564,LANGE,GREGORY,J,7506.0,670,1985-06-01,1250.0,300.0,23
10,7566,JONES,TERRY,M,7839.0,671,1985-04-02,2975.0,NaN,20
11,7569,ALBERTS,CHRIS,L,7839.0,671,1985-04-06,3000.0,NaN,12
12,7600,PORTER,RAYMOND,Y,7505.0,670,1985-04-15,1250.0,900.0,13
13,7609,LEWIS,RICHARD,M,7507.0,668,1985-04-16,1800.0,NaN,24
14,7654,MARTIN,KENNETH,J,7698.0,670,1985-09-28,1250.0,1400.0,30
15,7676,SOMMERS,DENISE,D,7507.0,668,1985-04-19,1850.0,NaN,34
16,7698,BLAKE,MARION,S,7839.0,671,1985-05-01,2850.0,NaN,30
17,7782,CLARK,CAROL,F,7839.0,671,1985-06-09,2450.0,NaN,10
18,7788,SCOTT,DONALD,T,7566.0,669,1986-12-09,3000.0,NaN,20
19,7789,WEST,LIVIA,N,7506.0,670,1985-04-04,1500.0,1000.0,23
20,7799,FISHER,MATTHEW,G,7569.0,669,1986-12-12,3000.0,NaN,12
21,7820,ROSS,PAUL,S,7505.0,670,1985-06-01,1300.0,800.0,43
22,7839,KING,FRANCIS,A,NaN,672,1985-11-17,5000.0,NaN,10
23,7844,TURNER,MARY,A,7698.0,670,1985-09-08,1500.0,0.0,30
24,7876,ADAMS,DIANE,G,7788.0,667,1987-01-12,1100.0,NaN,20
25,7900,JAMES,FRED,S,7698.0,667,1985-12-03,950.0,NaN,30
26,7902,FORD,JENNIFER,D,7566.0,669,1985-12-03,3000.0,NaN,20
27,7916,ROBERTS,GRACE,M,7569.0,669,1987-01-04,2875.0,NaN,12
28,7919,DOUGLAS,MICHAEL,A,7799.0,667,1987-01-04,800.0,NaN,12
29,7934,MILLER,BARBARA,M,7782.0,667,1986-01-23,1300.0,NaN,10
30,7950,JENSEN,ALICE,B,7505.0,667,1987-01-15,750.0,NaN,13
31,7954,MURRAY,JAMES,T,7506.0,667,1987-01-16,750.0,NaN,23

In [ ]:
data = pd.read_sql_query("SELECT * FROM employee", conn)
data.head(5)

# NULL в pandas-е транслируется для числовых типов в NaN (not a number)
# а для строковых в None (ничего)

In [ ]:
# ТАК НЕ ДЕЛАЕМ
pd.read_sql_query("""
SELECT * 
FROM  da.employee 
--WHERE  commission = NULL 
""", conn)

,employee_id,last_name,first_name,middle_initial,manager_id,job_id,hire_date,salary,commission,department_id
0,7369,SMITH,JOHN,Q,7902.0,667,1984-12-17,800.0,NaN,20
1,7499,ALLEN,KEVIN,J,7698.0,670,1985-02-20,1600.0,300.0,30
2,7505,DOYLE,JEAN,K,7839.0,671,1985-04-04,2850.0,NaN,13
3,7506,DENNIS,LYNN,S,7839.0,671,1985-05-15,2750.0,NaN,23
4,7507,BAKER,LESLIE,D,7839.0,671,1985-06-10,2200.0,NaN,14
5,7521,WARD,CYNTHIA,D,7698.0,670,1985-02-22,1250.0,500.0,30
6,7555,PETERS,DANIEL,T,7505.0,670,1985-03-31,1250.0,300.0,13
7,7557,SHAW,KAREN,P,7505.0,670,1985-04-02,1250.0,1200.0,13
8,7560,DUNCAN,SARAH,S,7506.0,670,1985-05-31,1250.0,NaN,23
9,7564,LANGE,GREGORY,J,7506.0,670,1985-06-01,1250.0,300.0,23
10,7566,JONES,TERRY,M,7839.0,671,1985-04-02,2975.0,NaN,20
11,7569,ALBERTS,CHRIS,L,7839.0,671,1985-04-06,3000.0,NaN,12
12,7600,PORTER,RAYMOND,Y,7505.0,670,1985-04-15,1250.0,900.0,13
13,7609,LEWIS,RICHARD,M,7507.0,668,1985-04-16,1800.0,NaN,24
14,7654,MARTIN,KENNETH,J,7698.0,670,1985-09-28,1250.0,1400.0,30
15,7676,SOMMERS,DENISE,D,7507.0,668,1985-04-19,1850.0,NaN,34
16,7698,BLAKE,MARION,S,7839.0,671,1985-05-01,2850.0,NaN,30
17,7782,CLARK,CAROL,F,7839.0,671,1985-06-09,2450.0,NaN,10
18,7788,SCOTT,DONALD,T,7566.0,669,1986-12-09,3000.0,NaN,20
19,7789,WEST,LIVIA,N,7506.0,670,1985-04-04,1500.0,1000.0,23
20,7799,FISHER,MATTHEW,G,7569.0,669,1986-12-12,3000.0,NaN,12
21,7820,ROSS,PAUL,S,7505.0,670,1985-06-01,1300.0,800.0,43
22,7839,KING,FRANCIS,A,NaN,672,1985-11-17,5000.0,NaN,10
23,7844,TURNER,MARY,A,7698.0,670,1985-09-08,1500.0,0.0,30
24,7876,ADAMS,DIANE,G,7788.0,667,1987-01-12,1100.0,NaN,20
25,7900,JAMES,FRED,S,7698.0,667,1985-12-03,950.0,NaN,30
26,7902,FORD,JENNIFER,D,7566.0,669,1985-12-03,3000.0,NaN,20
27,7916,ROBERTS,GRACE,M,7569.0,669,1987-01-04,2875.0,NaN,12
28,7919,DOUGLAS,MICHAEL,A,7799.0,667,1987-01-04,800.0,NaN,12
29,7934,MILLER,BARBARA,M,7782.0,667,1986-01-23,1300.0,NaN,10
30,7950,JENSEN,ALICE,B,7505.0,667,1987-01-15,750.0,NaN,13
31,7954,MURRAY,JAMES,T,7506.0,667,1987-01-16,750.0,NaN,23

In [ ]:
# ДЕЛАЕМ ТАК
pd.read_sql_query("""
SELECT * 
FROM   da.employee 
WHERE  commission IS NULL
""", conn)

,employee_id,last_name,first_name,middle_initial,manager_id,job_id,hire_date,salary,commission,department_id
0,7369,SMITH,JOHN,Q,7902.0,667,1984-12-17,800.0,None,20
1,7505,DOYLE,JEAN,K,7839.0,671,1985-04-04,2850.0,None,13
2,7506,DENNIS,LYNN,S,7839.0,671,1985-05-15,2750.0,None,23
3,7507,BAKER,LESLIE,D,7839.0,671,1985-06-10,2200.0,None,14
4,7560,DUNCAN,SARAH,S,7506.0,670,1985-05-31,1250.0,None,23
5,7566,JONES,TERRY,M,7839.0,671,1985-04-02,2975.0,None,20
6,7569,ALBERTS,CHRIS,L,7839.0,671,1985-04-06,3000.0,None,12
7,7609,LEWIS,RICHARD,M,7507.0,668,1985-04-16,1800.0,None,24
8,7676,SOMMERS,DENISE,D,7507.0,668,1985-04-19,1850.0,None,34
9,7698,BLAKE,MARION,S,7839.0,671,1985-05-01,2850.0,None,30
10,7782,CLARK,CAROL,F,7839.0,671,1985-06-09,2450.0,None,10
11,7788,SCOTT,DONALD,T,7566.0,669,1986-12-09,3000.0,None,20
12,7799,FISHER,MATTHEW,G,7569.0,669,1986-12-12,3000.0,None,12
13,7839,KING,FRANCIS,A,NaN,672,1985-11-17,5000.0,None,10
14,7876,ADAMS,DIANE,G,7788.0,667,1987-01-12,1100.0,None,20
15,7900,JAMES,FRED,S,7698.0,667,1985-12-03,950.0,None,30
16,7902,FORD,JENNIFER,D,7566.0,669,1985-12-03,3000.0,None,20
17,7916,ROBERTS,GRACE,M,7569.0,669,1987-01-04,2875.0,None,12
18,7919,DOUGLAS,MICHAEL,A,7799.0,667,1987-01-04,800.0,None,12
19,7934,MILLER,BARBARA,M,7782.0,667,1986-01-23,1300.0,None,10
20,7950,JENSEN,ALICE,B,7505.0,667,1987-01-15,750.0,None,13
21,7954,MURRAY,JAMES,T,7506.0,667,1987-01-16,750.0,None,23

Функция COALESCE возвращает первое значение, которое вычисляется не в NULL, и она очень удобна для обработки пропусков.

In [ ]:
pd.read_sql_query("""
SELECT 
commission
,salary
,COALESCE(commission, salary, 999) as attrib_1
,COALESCE(null, null, null, null,null, null,null, null,null, null ,999) as attrib_2
FROM   da.employee 
--WHERE  commission IS NULL 
""", conn)

    commission  salary  attrib_1  attrib_2
0          NaN   800.0     800.0       999
1        300.0  1600.0     300.0       999
2          NaN  2850.0    2850.0       999
3          NaN  2750.0    2750.0       999
4          NaN  2200.0    2200.0       999
5        500.0  1250.0     500.0       999
6        300.0  1250.0     300.0       999
7       1200.0  1250.0    1200.0       999
8          NaN  1250.0    1250.0       999
9        300.0  1250.0     300.0       999
10         NaN  2975.0    2975.0       999
11         NaN  3000.0    3000.0       999
12       900.0  1250.0     900.0       999
13         NaN  1800.0    1800.0       999
14      1400.0  1250.0    1400.0       999
15         NaN  1850.0    1850.0       999
16         NaN  2850.0    2850.0       999
17         NaN  2450.0    2450.0       999
18         NaN  3000.0    3000.0       999
19      1000.0  1500.0    1000.0       999
20         NaN  3000.0    3000.0       999
21       800.0  1300.0     800.0       999
22         NaN  5000.0    5000.0       999
23         0.0  1500.0       0.0       999
24         NaN  1100.0    1100.0       999
25         NaN   950.0     950.0       999
26         NaN  3000.0    3000.0       999
27         NaN  2875.0    2875.0       999
28         NaN   800.0     800.0       999
29         NaN  1300.0    1300.0       999
30         NaN   750.0     750.0       999
31         NaN   750.0     750.0       999

Посчитаем количество людей у которых нет коммиссионных

In [ ]:
pd.read_sql_query("""
SELECT Count(employee_id) AS "Кол-во сотрудников" 
FROM  da.employee 
WHERE  commission IS NULL 
""", conn)

   Кол-во сотрудников
0                  22

# Встроенные функции
В любой СУБД будет представлен большой спектр функций для работы с разными типами данных. Полный список приводить не имеет смысла, обращаемся к документации.

* [Работа со строками](https://postgrespro.ru/docs/postgrespro/9.5/functions-string)
* [Работа с датами](https://postgrespro.ru/docs/postgrespro/10/functions-datetime)
* [Работа с числами](https://postgrespro.ru/docs/postgrespro/9.5/functions-math)

Например, CONCAT функция конкатенации строк

In [ ]:
pd.read_sql_query("""
SELECT 
first_name, last_name, commission,
  CONCAT(first_name, ' ', last_name, ' commission = ', coalesce(commission, -1),' salary = ', salary) as concatenated
FROM da.employee
""", conn)

,first_name,last_name,commission,concatenated
0,JOHN,SMITH,NaN,JOHN SMITH commission = -1 salary = 800.00
1,KEVIN,ALLEN,300.0,KEVIN ALLEN commission = 300.00 salary = 1600.00
2,JEAN,DOYLE,NaN,JEAN DOYLE commission = -1 salary = 2850.00
3,LYNN,DENNIS,NaN,LYNN DENNIS commission = -1 salary = 2750.00
4,LESLIE,BAKER,NaN,LESLIE BAKER commission = -1 salary = 2200.00
5,CYNTHIA,WARD,500.0,CYNTHIA WARD commission = 500.00 salary = 1250.00
6,DANIEL,PETERS,300.0,DANIEL PETERS commission = 300.00 salary = 125...
7,KAREN,SHAW,1200.0,KAREN SHAW commission = 1200.00 salary = 1250.00
8,SARAH,DUNCAN,NaN,SARAH DUNCAN commission = -1 salary = 1250.00
9,GREGORY,LANGE,300.0,GREGORY LANGE commission = 300.00 salary = 125...
10,TERRY,JONES,NaN,TERRY JONES commission = -1 salary = 2975.00
11,CHRIS,ALBERTS,NaN,CHRIS ALBERTS commission = -1 salary = 3000.00
12,RAYMOND,PORTER,900.0,RAYMOND PORTER commission = 900.00 salary = 12...
13,RICHARD,LEWIS,NaN,RICHARD LEWIS commission = -1 salary = 1800.00
14,KENNETH,MARTIN,1400.0,KENNETH MARTIN commission = 1400.00 salary = 1...
15,DENISE,SOMMERS,NaN,DENISE SOMMERS commission = -1 salary = 1850.00
16,MARION,BLAKE,NaN,MARION BLAKE commission = -1 salary = 2850.00
17,CAROL,CLARK,NaN,CAROL CLARK commission = -1 salary = 2450.00
18,DONALD,SCOTT,NaN,DONALD SCOTT commission = -1 salary = 3000.00
19,LIVIA,WEST,1000.0,LIVIA WEST commission = 1000.00 salary = 1500.00
20,MATTHEW,FISHER,NaN,MATTHEW FISHER commission = -1 salary = 3000.00
21,PAUL,ROSS,800.0,PAUL ROSS commission = 800.00 salary = 1300.00
22,FRANCIS,KING,NaN,FRANCIS KING commission = -1 salary = 5000.00
23,MARY,TURNER,0.0,MARY TURNER commission = 0.00 salary = 1500.00
24,DIANE,ADAMS,NaN,DIANE ADAMS commission = -1 salary = 1100.00
25,FRED,JAMES,NaN,FRED JAMES commission = -1 salary = 950.00
26,JENNIFER,FORD,NaN,JENNIFER FORD commission = -1 salary = 3000.00
27,GRACE,ROBERTS,NaN,GRACE ROBERTS commission = -1 salary = 2875.00
28,MICHAEL,DOUGLAS,NaN,MICHAEL DOUGLAS commission = -1 salary = 800.00
29,BARBARA,MILLER,NaN,BARBARA MILLER commission = -1 salary = 1300.00
30,ALICE,JENSEN,NaN,ALICE JENSEN commission = -1 salary = 750.00
31,JAMES,MURRAY,NaN,JAMES MURRAY commission = -1 salary = 750.00

Или SUBSTR, функция взятия подстроки

In [ ]:
pd.read_sql_query("SELECT last_name, SUBSTR(last_name, 5, 3) FROM da.employee", conn)

   last_name substr
0      SMITH      H
1      ALLEN      N
2      DOYLE      E
3     DENNIS     IS
4      BAKER      R
5       WARD
6     PETERS     RS
7       SHAW
8     DUNCAN     AN
9      LANGE      E
10     JONES      S
11   ALBERTS    RTS
12    PORTER     ER
13     LEWIS      S
14    MARTIN     IN
15   SOMMERS    ERS
16     BLAKE      E
17     CLARK      K
18     SCOTT      T
19      WEST
20    FISHER     ER
21      ROSS
22      KING
23    TURNER     ER
24     ADAMS      S
25     JAMES      S
26      FORD
27   ROBERTS    RTS
28   DOUGLAS    LAS
29    MILLER     ER
30    JENSEN     EN
31    MURRAY     AY

Или набор функций для работы с числами такие как:
* ROUND округление 
* FLOOR, отбрасывание дробной части
* CEIL, округление вверх

In [ ]:
pd.read_sql_query("""
/*SELECT 
job_id,
count(*) as all_cnt,
count(distinct salary) as uniq_salary_cnt
FROM   da.employee
group by job_id
order by job_id*/

select *
from da.employee
where job_id = 670
order by salary
""", conn)

,employee_id,last_name,first_name,middle_initial,manager_id,job_id,hire_date,salary,commission,department_id
0,7654,MARTIN,KENNETH,J,7698,670,1985-09-28,1250.0,1400.0,30
1,7521,WARD,CYNTHIA,D,7698,670,1985-02-22,1250.0,500.0,30
2,7555,PETERS,DANIEL,T,7505,670,1985-03-31,1250.0,300.0,13
3,7557,SHAW,KAREN,P,7505,670,1985-04-02,1250.0,1200.0,13
4,7560,DUNCAN,SARAH,S,7506,670,1985-05-31,1250.0,NaN,23
5,7564,LANGE,GREGORY,J,7506,670,1985-06-01,1250.0,300.0,23
6,7600,PORTER,RAYMOND,Y,7505,670,1985-04-15,1250.0,900.0,13
7,7820,ROSS,PAUL,S,7505,670,1985-06-01,1300.0,800.0,43
8,7844,TURNER,MARY,A,7698,670,1985-09-08,1500.0,0.0,30
9,7789,WEST,LIVIA,N,7506,670,1985-04-04,1500.0,1000.0,23
10,7499,ALLEN,KEVIN,J,7698,670,1985-02-20,1600.0,300.0,30

# INSERT
Вставка в sql таблицы происходит довольно прямолинейно.

Основные варианты это

* INSERT INTO table (<тут через запятую перечисляем колонки>) VALUES (<тут через запятую перечисляем значения в том же порядке, в котором передаем колонки>)
* INSERT INTO table VALUES (<тогда мы должны перечислить значения для всех колонок таблицы>)
* INSERT INTO table (<тут через запятую перечисляем колонки>) VALUES (<тут через запятую перечисляем значения в том же порядке, в котором передаем колонки>), (<тут через запятую перечисляем значения в том же порядке, в котором передаем колонки>), (<тут через запятую перечисляем значения в том же порядке, в котором передаем колонки>), (<тут через запятую перечисляем значения в том же порядке, в котором передаем колонки>), .......... так мы можем вставить сразу несколько значений в таблицу

In [ ]:
pd.read_sql_query("SELECT * FROM da.product", conn)

    product_id                   description
0       100860           ACE TENNIS RACKET I
1       100861          ACE TENNIS RACKET II
2       100870       ACE TENNIS BALLS-3 PACK
3       100871       ACE TENNIS BALLS-6 PACK
4       100890                ACE TENNIS NET
5       101860              SP TENNIS RACKET
6       101863              SP JUNIOR RACKET
7       102130         RH: "GUIDE TO TENNIS"
8       200376          SB ENERGY BAR-6 PACK
9       200380          SB VITA SNACK-6 PACK
10      103120           WIFF SOFTBALL BAT I
11      103121          WIFF SOFTBALL BAT II
12      103130          WIFF SOFTBALL, SMALL
13      103131          WIFF SOFTBALL, LARGE
14      103140       WIFF SOFTBALL MITT (LH)
15      103141       WIFF SOFTBALL MITT (RH)
16      102132       RH: "GUIDE TO SOFTBALL"
17      104350        DUNK BASKETBALL INDOOR
18      104351       DUNK BASKETBALL OUTDOOR
19      104352  DUNK BASKETBALL PROFESSIONAL
20      104360                     DUNK HOOP
21      104361  DUNK HOOP W/FIBERGLASS BOARD
22      104362           DUNK NETS - RAINBOW
23      102134     RH: "GUIDE TO BASKETBALL"
24      105123  YELLOW JERSEY BICYCLE HELMET
25      105124  YELLOW JERSEY BICYCLE GLOVES
26      105125    YELLOW JERSEY WATER BOTTLE
27      105126     YELLOW JERSEY BOTTLE CAGE
28      105127      YELLOW JERSEY FRAME PUMP
29      105128     YELLOW JERSEY SADDLE PACK
30      102136        RH: "GUIDE TO CYCLING"
31     1234567                         test3
32      111111                         test2
33      222222                         test3
34      333333                         test4
35      444444                         test5
36    12345678                         test3
37  1234567899                        test10
38    12345679                         test9
39   123456789                        test31
40         555                       test555
41    12345600                        test01
42    11111100                        test02
43    33333300                        test04
44      123456                 test2 changed

Добавим в таблицу еще одну запись о продукте

In [ ]:
conn = psycopg2.connect(host=DB_HOST, user=DB_USER, password=DB_USER_PASSWORD, dbname=DB_NAME)

query = """
INSERT INTO da.product (product_id, description) VALUES (-100, 'Holodilnik')
""" # наш запрос
# надо его выполнить


# изменения происходят через специальный интерфейс -- объект-курсор базы данных
cursor = conn.cursor()

cursor.execute(query) # выполняем наш запрос

conn.commit() # применяем изменения

Обратите внимание, что необходимо применить изменения (commit()) или откатить их (rollback())! Иначе таблица еще не изменена физически на сервере. Это защитный транзакционный механизм. Подробнее об этом можно почитать [здесь](https://habr.com/ru/post/446662/). Механизм транзакций остается за рамками нашего курса.

In [ ]:
pd.read_sql_query("SELECT * FROM da.product", conn)

    product_id                   description
0       100860           ACE TENNIS RACKET I
1       100861          ACE TENNIS RACKET II
2       100870       ACE TENNIS BALLS-3 PACK
3       100871       ACE TENNIS BALLS-6 PACK
4       100890                ACE TENNIS NET
5       101860              SP TENNIS RACKET
6       101863              SP JUNIOR RACKET
7       102130         RH: "GUIDE TO TENNIS"
8       200376          SB ENERGY BAR-6 PACK
9       200380          SB VITA SNACK-6 PACK
10      103120           WIFF SOFTBALL BAT I
11      103121          WIFF SOFTBALL BAT II
12      103130          WIFF SOFTBALL, SMALL
13      103131          WIFF SOFTBALL, LARGE
14      103140       WIFF SOFTBALL MITT (LH)
15      103141       WIFF SOFTBALL MITT (RH)
16      102132       RH: "GUIDE TO SOFTBALL"
17      104350        DUNK BASKETBALL INDOOR
18      104351       DUNK BASKETBALL OUTDOOR
19      104352  DUNK BASKETBALL PROFESSIONAL
20      104360                     DUNK HOOP
21      104361  DUNK HOOP W/FIBERGLASS BOARD
22      104362           DUNK NETS - RAINBOW
23      102134     RH: "GUIDE TO BASKETBALL"
24      105123  YELLOW JERSEY BICYCLE HELMET
25      105124  YELLOW JERSEY BICYCLE GLOVES
26      105125    YELLOW JERSEY WATER BOTTLE
27      105126     YELLOW JERSEY BOTTLE CAGE
28      105127      YELLOW JERSEY FRAME PUMP
29      105128     YELLOW JERSEY SADDLE PACK
30      102136        RH: "GUIDE TO CYCLING"
31     1234567                         test3
32      111111                         test2
33      222222                         test3
34      333333                         test4
35      444444                         test5
36    12345678                         test3
37  1234567899                        test10
38    12345679                         test9
39   123456789                        test31
40         555                       test555
41    12345600                        test01
42    11111100                        test02
43    33333300                        test04
44      123456                 test2 changed
45        -100                    Holodilnik
46     -123456                         test1
47     -111111                         test2
48     -222222                         test3
49     -333333                         test4
50     -444444                         test5

Если нам нужно вставить сразу много данных, то мы можем просто выполнять запрос по одному в цикле, подставляя нужные значения в шаблон запроса

In [ ]:
products_data = {
      -123456: 'test1',
      -111111: 'test2',
      -222222: 'test3',
      -333333: 'test4',
      -444444: 'test5',
    }

# задание, внести все записи в таблицу product 
# используя функцию .format() для работы со строками
query_template = """
INSERT INTO da.product (product_id, description) VALUES ({}, '{}')
"""

cursor = conn.cursor()
for pr_id, desc in products_data.items():
  query = query_template.format(pr_id, desc)
  print(query)
  cursor.execute(query)

conn.commit()

INSERT INTO da.product (product_id, description) VALUES (-123456, 'test1')


INSERT INTO da.product (product_id, description) VALUES (-111111, 'test2')


INSERT INTO da.product (product_id, description) VALUES (-222222, 'test3')


INSERT INTO da.product (product_id, description) VALUES (-333333, 'test4')


INSERT INTO da.product (product_id, description) VALUES (-444444, 'test5')

Но это может быть дольше, чем использовать специальный механизм [executemany()](http://zetcode.com/python/psycopg2/), который по сути превращает шаблон запроса в вид 3-его типа INSERT из шапки этого раздела.

# UPDATE
Обновление делается довольно прямолинейно, мы указываем новые значения для колонок, и выбираем только то подмножество объектов, которое удовлетворяет условию WHERE.

In [ ]:
query = """
UPDATE da.product 
SET    description = 'test1 changed 17.11.2022' 
WHERE  product_id = -666666 
"""

cursor = conn.cursor()

cursor.execute(query) 

conn.commit()

In [ ]:
pd.read_sql_query("select * from da.product", conn)

    product_id                   description
0       100860           ACE TENNIS RACKET I
1       100861          ACE TENNIS RACKET II
2       100870       ACE TENNIS BALLS-3 PACK
3       100871       ACE TENNIS BALLS-6 PACK
4       100890                ACE TENNIS NET
5       101860              SP TENNIS RACKET
6       101863              SP JUNIOR RACKET
7       102130         RH: "GUIDE TO TENNIS"
8       200376          SB ENERGY BAR-6 PACK
9       200380          SB VITA SNACK-6 PACK
10      103120           WIFF SOFTBALL BAT I
11      103121          WIFF SOFTBALL BAT II
12      103130          WIFF SOFTBALL, SMALL
13      103131          WIFF SOFTBALL, LARGE
14      103140       WIFF SOFTBALL MITT (LH)
15      103141       WIFF SOFTBALL MITT (RH)
16      102132       RH: "GUIDE TO SOFTBALL"
17      104350        DUNK BASKETBALL INDOOR
18      104351       DUNK BASKETBALL OUTDOOR
19      104352  DUNK BASKETBALL PROFESSIONAL
20      104360                     DUNK HOOP
21      104361  DUNK HOOP W/FIBERGLASS BOARD
22      104362           DUNK NETS - RAINBOW
23      102134     RH: "GUIDE TO BASKETBALL"
24      105123  YELLOW JERSEY BICYCLE HELMET
25      105124  YELLOW JERSEY BICYCLE GLOVES
26      105125    YELLOW JERSEY WATER BOTTLE
27      105126     YELLOW JERSEY BOTTLE CAGE
28      105127      YELLOW JERSEY FRAME PUMP
29      105128     YELLOW JERSEY SADDLE PACK
30      102136        RH: "GUIDE TO CYCLING"
31     1234567                         test3
32      111111                         test2
33      222222                         test3
34      333333                         test4
35      444444                         test5
36    12345678                         test3
37  1234567899                        test10
38    12345679                         test9
39   123456789                        test31
40         555                       test555
41    12345600                        test01
42    11111100                        test02
43    33333300                        test04
44      123456                 test2 changed
45        -100                    Holodilnik
46     -111111                         test2
47     -222222                         test3
48     -333333                         test4
49     -444444                         test5
50     -123456      test1 changed 17.11.2022

# DELETE
Удаление работает практически аналогично обновлению

In [ ]:
query = """
DELETE FROM da.product 
WHERE  product_id IN ( -100, -123456 ) 
"""

cursor = conn.cursor()

cursor.execute(query)

conn.commit()

In [ ]:
pd.read_sql_query("select * from da.product", conn)

    product_id                   description
0       100860           ACE TENNIS RACKET I
1       100861          ACE TENNIS RACKET II
2       100870       ACE TENNIS BALLS-3 PACK
3       100871       ACE TENNIS BALLS-6 PACK
4       100890                ACE TENNIS NET
5       101860              SP TENNIS RACKET
6       101863              SP JUNIOR RACKET
7       102130         RH: "GUIDE TO TENNIS"
8       200376          SB ENERGY BAR-6 PACK
9       200380          SB VITA SNACK-6 PACK
10      103120           WIFF SOFTBALL BAT I
11      103121          WIFF SOFTBALL BAT II
12      103130          WIFF SOFTBALL, SMALL
13      103131          WIFF SOFTBALL, LARGE
14      103140       WIFF SOFTBALL MITT (LH)
15      103141       WIFF SOFTBALL MITT (RH)
16      102132       RH: "GUIDE TO SOFTBALL"
17      104350        DUNK BASKETBALL INDOOR
18      104351       DUNK BASKETBALL OUTDOOR
19      104352  DUNK BASKETBALL PROFESSIONAL
20      104360                     DUNK HOOP
21      104361  DUNK HOOP W/FIBERGLASS BOARD
22      104362           DUNK NETS - RAINBOW
23      102134     RH: "GUIDE TO BASKETBALL"
24      105123  YELLOW JERSEY BICYCLE HELMET
25      105124  YELLOW JERSEY BICYCLE GLOVES
26      105125    YELLOW JERSEY WATER BOTTLE
27      105126     YELLOW JERSEY BOTTLE CAGE
28      105127      YELLOW JERSEY FRAME PUMP
29      105128     YELLOW JERSEY SADDLE PACK
30      102136        RH: "GUIDE TO CYCLING"
31     1234567                         test3
32      111111                         test2
33      222222                         test3
34      333333                         test4
35      444444                         test5
36    12345678                         test3
37  1234567899                        test10
38    12345679                         test9
39   123456789                        test31
40         555                       test555
41    12345600                        test01
42    11111100                        test02
43    33333300                        test04
44      123456                 test2 changed
45     -111111                         test2
46     -222222                         test3
47     -333333                         test4
48     -444444                         test5

Стоит явно закрыть соединение с базой данных после прекращения работы с ней

In [ ]:
conn.close()

# JOIN

![king.gif]()


Эта часть посвящена соединениям таблиц, соединениями необходимо очень уверенно оперировать, чтобы не возникало проблем в повседневной практике написания запросов.

Подключимся к базе

In [ ]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in /usr/local/lib/python3.6/dist-packages (2.7.6.1)

In [ ]:
import psycopg2
import pandas as pd
# доступны student-ы от 0 до 9

DB_HOST = '89.223.95.138'
DB_USER = 'student_0'
DB_USER_PASSWORD = 'student_0'
DB_NAME = 'sample_db'

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [ ]:
conn = psycopg2.connect(host=DB_HOST, user=DB_USER, password=DB_USER_PASSWORD, dbname=DB_NAME)
pd.read_sql_query("select * from da.customer", conn)

,customer_id,name,address,city,state,zip_code,area_code,phone_number,salesperson_id,credit_limit,comments
0,100,JOCKSPORTS,345 VIEWRIDGE,BELMONT,CA,96711,415,5986609,7844,5000.0,Very friendly people to work with -- sales rep...
1,101,TKB SPORT SHOP,490 BOLI RD.,REDWOOD CITY,CA,94061,415,3681223,7521,10000.0,Rep called 5/8 about change in order - contact...
2,102,VOLLYRITE,9722 HAMILTON,BURLINGAME,CA,95133,415,6443341,7654,7000.0,Company doing heavy promotion beginning 10/89....
3,103,JUST TENNIS,HILLVIEW MALL,BURLINGAME,CA,97544,415,6779312,7521,3000.0,Contact rep about new line of tennis rackets.
4,104,EVERY MOUNTAIN,574 SURRY RD.,CUPERTINO,CA,93301,408,9962323,7499,10000.0,Customer with high market share (23%) due to a...
5,105,K + T SPORTS,3476 EL PASEO,SANTA CLARA,CA,91003,408,3769966,7844,5000.0,Tends to order large amounts of merchandise at...
6,106,SHAPE UP,908 SEQUOIA,PALO ALTO,CA,94301,415,3649777,7521,6000.0,Support intensive. Orders small amounts (< 800...
7,107,WOMENS SPORTS,VALCO VILLAGE,SUNNYVALE,CA,93301,408,9674398,7499,10000.0,First sporting goods store geared exclusively ...
8,108,NORTH WOODS HEALTH AND FITNESS SUPPLY CENTER,98 LONE PINE WAY,HIBBING,MN,55649,612,5669123,7844,8000.0,
9,201,STADIUM SPORTS,47 IRVING PL.,NEW YORK,NY,10003,212,5555335,7557,10000.0,Large general-purpose sports store with an aff...
10,202,HOOPS,2345 ADAMS AVE.,LEICESTER,MA,01524,508,5557542,7820,5000.0,Specializes in basketball equipment.
11,203,REBOUND SPORTS,2 E. 14TH ST.,NEW YORK,NY,10009,212,5555989,7557,10000.0,Follow up on the promotion proposal.
12,204,THE POWER FORWARD,1 KNOTS LANDING,DALLAS,TX,75248,214,5550505,7560,12000.0,Large floorspace. Prefers maintaining large a...
13,205,POINT GUARD,20 THURSTON ST.,YONKERS,NY,10956,914,5554766,7557,3000.0,Tremendous potential for an exclusive agreement.
14,206,THE COLISEUM,5678 WILBUR PL.,SCARSDALE,NY,10583,914,5550217,7557,6000.0,Contact rep. about new product lines.
15,207,FAST BREAK,1000 HERBERT LN.,CONCORD,MA,01742,508,5551298,7820,7000.0,Customer requires written price quotes before ...
16,208,AL AND BOB'S SPORTS,260 YORKTOWN CT.,AUSTIN,TX,78731,512,5557631,7560,4000.0,Very personal purchasing agents -- Sharon and ...
17,211,AT BAT,234 BEACHEM ST.,BROOKLINE,MA,02146,617,5557385,7820,8000.0,Have an open purchase order for $3000. Ship i...
18,212,ALL SPORT,1000 38TH ST.,BROOKLYN,NY,11210,718,5551739,7600,6000.0,Pursue a contract -- possible candidate for vo...
19,213,GOOD SPORT,400 46TH ST.,SUNNYSIDE,NY,11104,718,5553771,7600,5000.0,May be moving to a larger location.
20,214,AL'S PRO SHOP,45 SPRUCE ST.,SPRING,TX,77388,713,5555172,7564,8000.0,Target market is serious athletes.
21,215,BOB'S FAMILY SPORTS,400 E. 23RD,HOUSTON,TX,77026,713,5558015,7654,8000.0,Target market is casual and weekend athletes. ...
22,216,THE ALL AMERICAN,547 PRENTICE RD.,CHELSEA,MA,02150,617,5553047,7820,5000.0,Customer prefers to be called between 10 and 12.
23,217,"HIT, THROW, AND RUN",333 WOOD COURT,GRAPEVINE,TX,76051,817,5552352,7564,6000.0,General purpose sports store.
24,218,THE OUTFIELD,346 GARDEN BLVD.,FLUSHING,NY,11355,718,5552131,7820,4000.0,Store does not open until 11am and does not ha...
25,221,WHEELS AND DEALS,2 MEMORIAL DRIVE,HOUSTON,TX,77007,713,5554139,7789,10000.0,Discount bicycle and sporting good store.
26,222,JUST BIKES,4000 PARKRIDGE BLVD.,DALLAS,TX,75205,214,5558735,7789,4000.0,Exclusive bicycle dealer.
27,223,VELO SPORTS,23 WHITE ST.,MALDEN,MA,02148,617,5554983,7820,5000.0,Clerk answers all phone lines. Ask for Mike.
28,224,JOE'S BIKE SHOP,4500 FOX COURT,GRAND PRARIE,TX,75051,214,5559834,7789,6000.0,Call Joe to make sure last shipment was complete.
29,225,"BOB'S SWIM, CYCLE, AND RUN",300 HORSECREEK CIRCLE,IRVING,TX,75039,214,5558388,7789,7000.0,Store catering to triathletes.
30,226,CENTURY SHOP,8 DAGMAR DR.,HUNTINGTON,NY,11743,516,5553006,7555,4000.0,Customer in the midst of a cost-cutting program.
31,227,THE TOUR,2500 GARDNER RD.,SOMERVILLE,MA,02144,617,5556673,7820,5000.0,Customer referred to us by The All American.
32,228,FITNESS FIRST,5000 85TH ST.,JACKSON HEIGHTS,NY,11372,718,5558710,7555,4000.0,Recently acquired another sporting goods store...

Итак, похоже все хорошо

### Inner join
Внутреннее соединение берет подмножество всевозможных пар строк (декартово произведение) из первой (или левой) таблицы и второй (или правой) таблицы в которых выполняется условие переданное при соединении. Внутренние соединения не учитывают ситуации, когда значения столбцов, участвующих в логическом условии в левой или правой таблице отсутствуют. Если нужно работать с такими значениями, нужно пользоваться внешними соединениями (LEFT, RIGHT, FULL...) о которых речь пойдет чуть позже.

При соединении таблиц в общем синтаксис можно описать так:

```
SELECT
  ...
FROM
  <левая таблица> AS <опционально, псевдоним левой таблицы>
  <тип соединения> JOIN
  <правая таблица> AS <опционально, псевдоним правой таблицы>
  ON <логическое условие>
```

Подсчитаем кол-во строк в таблицах job и employee

In [ ]:
pd.read_sql_query("""
SELECT COUNT(*) FROM da.job
""", conn)

   count
0      6

In [ ]:
pd.read_sql_query("""
SELECT COUNT(*) FROM da.employee
""", conn)

   count
0     32

Таким образом, мы ожидаем 6*32 = 192 строки в результате декартова произведения

In [ ]:
# декартово произведение
pd.read_sql_query("""
SELECT
  employee_id,
  function,
  employee.job_id,
  job.job_id
FROM da.employee
inner JOIN da.job
""", conn)

     employee_id   function  job_id  job_id
0           7369      CLERK     667     667
1           7499      CLERK     670     667
2           7505      CLERK     671     667
3           7506      CLERK     671     667
4           7507      CLERK     671     667
..           ...        ...     ...     ...
187         7916  PRESIDENT     669     672
188         7919  PRESIDENT     667     672
189         7934  PRESIDENT     667     672
190         7950  PRESIDENT     667     672
191         7954  PRESIDENT     667     672

[192 rows x 4 columns]

Видим, что получилось ровно 192 строки, используя логические условия на столбцы левой и правой таблиц, мы можем взять разные подмножества этого множества.

Стоит также отметить, что, конечно, на самом деле postgresql необязательно рассматривает все подмножество, имеют место внутренние оптимизации. Детали этого процесса остаются за рамками этого курса. Начать погружение в эту тему можно, например, с этой [статьи](https://www.cybertec-postgresql.com/en/join-strategies-and-performance-in-postgresql/).

В качестве примера отобразим название должности каждого сотрудника. 

Обратите внимание, что мы указываем в логическом условии полные названия таблиц, потому что иначе sql сервер не поймет где какой столбец. В данном случае названия столбцов совпадают, тем не менее если они не совпадают и sql сервер и так может понять какие столбцы относятся к левой, а какие к правой таблице, все равно стоит указывать полные названия таблиц, так как это просто хороший стиль.

In [ ]:
pd.read_sql_query("""
SELECT
  employee_id,
  function,
  employee.job_id
FROM da.employee
INNER JOIN da.job
  ON employee.job_id = job.job_id
""", conn)

    employee_id     function  job_id
0          7369        CLERK     667
1          7499  SALESPERSON     670
2          7505      MANAGER     671
3          7506      MANAGER     671
4          7507      MANAGER     671
5          7521  SALESPERSON     670
6          7555  SALESPERSON     670
7          7557  SALESPERSON     670
8          7560  SALESPERSON     670
9          7564  SALESPERSON     670
10         7566      MANAGER     671
11         7569      MANAGER     671
12         7600  SALESPERSON     670
13         7609        STAFF     668
14         7654  SALESPERSON     670
15         7676        STAFF     668
16         7698      MANAGER     671
17         7782      MANAGER     671
18         7788      ANALYST     669
19         7789  SALESPERSON     670
20         7799      ANALYST     669
21         7820  SALESPERSON     670
22         7839    PRESIDENT     672
23         7844  SALESPERSON     670
24         7876        CLERK     667
25         7900        CLERK     667
26         7902      ANALYST     669
27         7916      ANALYST     669
28         7919        CLERK     667
29         7934        CLERK     667
30         7950        CLERK     667
31         7954        CLERK     667

Названия таблиц могут быть довольно длинными, поэтому часто можно увидеть использование псевдонимов

In [ ]:
pd.read_sql_query("""
select * from (
SELECT
  empl.employee_id,
  j.function,
  empl.job_id,
  j.job_id
FROM da.employee AS empl
INNER JOIN da.job AS j
  ON empl.job_id = j.job_id
  ) t
""", conn)

    employee_id     function  job_id  job_id
0          7369        CLERK     667     667
1          7499  SALESPERSON     670     670
2          7505      MANAGER     671     671
3          7506      MANAGER     671     671
4          7507      MANAGER     671     671
5          7521  SALESPERSON     670     670
6          7555  SALESPERSON     670     670
7          7557  SALESPERSON     670     670
8          7560  SALESPERSON     670     670
9          7564  SALESPERSON     670     670
10         7566      MANAGER     671     671
11         7569      MANAGER     671     671
12         7600  SALESPERSON     670     670
13         7609        STAFF     668     668
14         7654  SALESPERSON     670     670
15         7676        STAFF     668     668
16         7698      MANAGER     671     671
17         7782      MANAGER     671     671
18         7788      ANALYST     669     669
19         7789  SALESPERSON     670     670
20         7799      ANALYST     669     669
21         7820  SALESPERSON     670     670
22         7839    PRESIDENT     672     672
23         7844  SALESPERSON     670     670
24         7876        CLERK     667     667
25         7900        CLERK     667     667
26         7902      ANALYST     669     669
27         7916      ANALYST     669     669
28         7919        CLERK     667     667
29         7934        CLERK     667     667
30         7950        CLERK     667     667
31         7954        CLERK     667     667

Допустим, нам также понадобилось поле job_id. Если нужно отобразить колонку, которая есть и в той, и в другой таблице, нужно явно указать из какой таблицы мы берём эту колонку (потому что иначе опять таки неясно где столбец левой таблицы, а где столбец правой таблицы).

In [ ]:
pd.read_sql_query("""
SELECT
  employee_id,
  function,
  l.job_id,
  r.job_id
FROM da.employee AS l
INNER JOIN da.job AS r
  ON l.job_id = r.job_id
""", conn)

    employee_id     function  job_id  job_id
0          7954        clerk     667     667
1          7950        clerk     667     667
2          7934        clerk     667     667
3          7919        clerk     667     667
4          7900        clerk     667     667
5          7876        clerk     667     667
6          7369        clerk     667     667
7          7676        staff     668     668
8          7609        staff     668     668
9          7916      analyst     669     669
10         7902      analyst     669     669
11         7799      analyst     669     669
12         7788      analyst     669     669
13         7844  salesperson     670     670
14         7820  salesperson     670     670
15         7789  salesperson     670     670
16         7654  salesperson     670     670
17         7600  salesperson     670     670
18         7564  salesperson     670     670
19         7560  salesperson     670     670
20         7557  salesperson     670     670
21         7555  salesperson     670     670
22         7521  salesperson     670     670
23         7499  salesperson     670     670
24         7782      manager     671     671
25         7698      manager     671     671
26         7569      manager     671     671
27         7566      manager     671     671
28         7507      manager     671     671
29         7506      manager     671     671
30         7505      manager     671     671
31         7839    president     672     672

В принципе для INNER JOIN есть альтернативный синтаксис. Здесь запятая это по сути CROSS JOIN (декартово произведение), но предпочтительно все-таки делать соединение явно

In [ ]:
pd.read_sql_query("""
SELECT
  employee_id,
  function
FROM da.employee, job
WHERE
  employee.job_id = job.job_id
""", conn)

    employee_id     function
0          7369        CLERK
1          7499  SALESPERSON
2          7505      MANAGER
3          7506      MANAGER
4          7507      MANAGER
5          7521  SALESPERSON
6          7555  SALESPERSON
7          7557  SALESPERSON
8          7560  SALESPERSON
9          7564  SALESPERSON
10         7566      MANAGER
11         7569      MANAGER
12         7600  SALESPERSON
13         7609        STAFF
14         7654  SALESPERSON
15         7676        STAFF
16         7698      MANAGER
17         7782      MANAGER
18         7788      ANALYST
19         7789  SALESPERSON
20         7799      ANALYST
21         7820  SALESPERSON
22         7839    PRESIDENT
23         7844  SALESPERSON
24         7876        CLERK
25         7900        CLERK
26         7902      ANALYST
27         7916      ANALYST
28         7919        CLERK
29         7934        CLERK
30         7950        CLERK
31         7954        CLERK

Ниже вы можете увидеть схему, описывающие детально как происходит процесс отбора при внутреннем соединении.

In [ ]:
"""
Job
===============
job_id function
===============
667    clerk

Employee
=====================================
employee_id last_name ... job_id ...
=====================================
7369        smith         667            -> 667 = 667 ? -> True -> соединяем с этой строкой
7876        adams         667            -> 667 = 667 ? -> True -> соединяем с этой строкой
7954        murray        668            -> 668 = 667 ? -> False -> не соединяем с этой строкой
"""

### LEFT (OUTER) JOIN
Левое внешнее соединение, позволяет нам обрабатывать ситуацию отсутствия значения в правой таблице. Левое внешнее соединение оставляет все строки левой таблицы.

In [ ]:
pd.read_sql_query("""
  SELECT * FROM da.product
""",conn)

    product_id                   description
0       100860           ACE TENNIS RACKET I
1       100861          ACE TENNIS RACKET II
2       100870       ACE TENNIS BALLS-3 PACK
3       100871       ACE TENNIS BALLS-6 PACK
4       100890                ACE TENNIS NET
5       101860              SP TENNIS RACKET
6       101863              SP JUNIOR RACKET
7       102130         RH: "GUIDE TO TENNIS"
8       200376          SB ENERGY BAR-6 PACK
9       200380          SB VITA SNACK-6 PACK
10      103120           WIFF SOFTBALL BAT I
11      103121          WIFF SOFTBALL BAT II
12      103130          WIFF SOFTBALL, SMALL
13      103131          WIFF SOFTBALL, LARGE
14      103140       WIFF SOFTBALL MITT (LH)
15      103141       WIFF SOFTBALL MITT (RH)
16      102132       RH: "GUIDE TO SOFTBALL"
17      104350        DUNK BASKETBALL INDOOR
18      104351       DUNK BASKETBALL OUTDOOR
19      104352  DUNK BASKETBALL PROFESSIONAL
20      104360                     DUNK HOOP
21      104361  DUNK HOOP W/FIBERGLASS BOARD
22      104362           DUNK NETS - RAINBOW
23      102134     RH: "GUIDE TO BASKETBALL"
24      105123  YELLOW JERSEY BICYCLE HELMET
25      105124  YELLOW JERSEY BICYCLE GLOVES
26      105125    YELLOW JERSEY WATER BOTTLE
27      105126     YELLOW JERSEY BOTTLE CAGE
28      105127      YELLOW JERSEY FRAME PUMP
29      105128     YELLOW JERSEY SADDLE PACK
30      102136        RH: "GUIDE TO CYCLING"
31     1234567                         test3
32      111111                         test2
33      222222                         test3
34      333333                         test4
35      444444                         test5
36    12345678                         test3
37  1234567899                        test10
38    12345679                         test9
39   123456789                        test31
40         555                       test555
41    12345600                        test01
42    11111100                        test02
43    33333300                        test04
44      123456                 test2 changed
45     -111111                         test2
46     -222222                         test3
47     -333333                         test4
48     -444444                         test5

In [ ]:
# добавим несуществующий продукт в таблицу product
query = """
INSERT INTO da.product (product_id, description) VALUES (123456, 'test2')
""" # вот наш запрос
# теперь надо его выполнить
# изменения происходят через специальный интерфейс: объект-курсор базы данных
cursor = conn.cursor()

cursor.execute(query) # выполняем наш запрос

conn.commit() # подтверждаем транзакцию (передаём сигнал, всё, конец)

UniqueViolation: ignored

In [ ]:
pd.read_sql_query("""
  SELECT * FROM da.product
""",conn)

    product_id                   description
0       100860           ACE TENNIS RACKET I
1       100861          ACE TENNIS RACKET II
2       100870       ACE TENNIS BALLS-3 PACK
3       100871       ACE TENNIS BALLS-6 PACK
4       100890                ACE TENNIS NET
5       101860              SP TENNIS RACKET
6       101863              SP JUNIOR RACKET
7       102130         RH: "GUIDE TO TENNIS"
8       200376          SB ENERGY BAR-6 PACK
9       200380          SB VITA SNACK-6 PACK
10      103120           WIFF SOFTBALL BAT I
11      103121          WIFF SOFTBALL BAT II
12      103130          WIFF SOFTBALL, SMALL
13      103131          WIFF SOFTBALL, LARGE
14      103140       WIFF SOFTBALL MITT (LH)
15      103141       WIFF SOFTBALL MITT (RH)
16      102132       RH: "GUIDE TO SOFTBALL"
17      104350        DUNK BASKETBALL INDOOR
18      104351       DUNK BASKETBALL OUTDOOR
19      104352  DUNK BASKETBALL PROFESSIONAL
20      104360                     DUNK HOOP
21      104361  DUNK HOOP W/FIBERGLASS BOARD
22      104362           DUNK NETS - RAINBOW
23      102134     RH: "GUIDE TO BASKETBALL"
24      105123  YELLOW JERSEY BICYCLE HELMET
25      105124  YELLOW JERSEY BICYCLE GLOVES
26      105125    YELLOW JERSEY WATER BOTTLE
27      105126     YELLOW JERSEY BOTTLE CAGE
28      105127      YELLOW JERSEY FRAME PUMP
29      105128     YELLOW JERSEY SADDLE PACK
30      102136        RH: "GUIDE TO CYCLING"
31     1234567                         test3
32      111111                         test2
33      222222                         test3
34      333333                         test4
35      444444                         test5
36    12345678                         test3
37  1234567899                        test10
38    12345679                         test9
39   123456789                        test31
40         555                       test555
41    12345600                        test01
42    11111100                        test02
43    33333300                        test04
44      123456                 test2 changed
45     -111111                         test2
46     -222222                         test3
47     -333333                         test4
48     -444444                         test5

Cоединим таблицу product с таблицей price по полю product_id

In [ ]:
pd.read_sql_query("""
SELECT * 
FROM da.product
INNER JOIN da.price
     ON product.product_id = price.product_id
     and cast('1989-05-24' as date) between price.start_date and price.end_date
order by product.product_id, price.start_date
""",conn)

,product_id,description,product_id,list_price,min_price,start_date,end_date
0,100860,ACE TENNIS RACKET I,100860,30.0,24.0,1989-01-01,1989-12-31
1,100861,ACE TENNIS RACKET II,100861,39.0,31.2,1989-01-01,1989-12-31
2,100870,ACE TENNIS BALLS-3 PACK,100870,2.4,1.9,1989-01-01,1989-12-01
3,100871,ACE TENNIS BALLS-6 PACK,100871,4.8,3.2,1989-01-01,1989-12-01
4,103120,WIFF SOFTBALL BAT I,103120,23.2,18.6,1989-01-01,1989-12-31
5,103121,WIFF SOFTBALL BAT II,103121,27.8,22.3,1989-01-01,1989-12-31
6,103130,"WIFF SOFTBALL, SMALL",103130,4.0,3.5,1989-01-01,1989-12-31
7,103131,"WIFF SOFTBALL, LARGE",103131,4.2,3.6,1989-01-01,1989-12-31
8,104350,DUNK BASKETBALL INDOOR,104350,40.0,32.0,1989-01-01,1989-12-31
9,104351,DUNK BASKETBALL OUTDOOR,104351,23.6,18.9,1989-01-01,1989-12-31
10,104352,DUNK BASKETBALL PROFESSIONAL,104352,50.0,35.0,1989-01-01,1989-12-31
11,104360,DUNK HOOP,104360,36.0,29.5,1989-01-01,1989-12-31
12,104361,DUNK HOOP W/FIBERGLASS BOARD,104361,47.0,33.0,1989-01-01,1989-12-31
13,105123,YELLOW JERSEY BICYCLE HELMET,105123,36.3,29.0,1989-01-01,1989-12-31
14,105124,YELLOW JERSEY BICYCLE GLOVES,105124,10.0,7.6,1989-01-01,1989-12-31
15,105125,YELLOW JERSEY WATER BOTTLE,105125,2.0,1.7,1989-01-01,1989-12-31
16,105126,YELLOW JERSEY BOTTLE CAGE,105126,5.0,4.3,1989-01-01,1989-12-31

Cоединим таблицу product с таблицей price по полю product_id, но теперь воспользуемся LEFT JOIN, отобразим записи о продуктах, которые никак не отражены в таблице price

In [ ]:
pd.read_sql_query("""
SELECT * 
FROM da.product
LEFT JOIN da.price
     ON product.product_id = price.product_id
""",conn)

,product_id,description,product_id,list_price,min_price,start_date,end_date
0,100871,ACE TENNIS BALLS-6 PACK,100871.0,4.8,3.2,1989-01-01,1989-12-01
1,100890,ACE TENNIS NET,100890.0,58.0,46.4,1989-01-01,NaT
2,100890,ACE TENNIS NET,100890.0,54.0,40.5,1988-06-01,1988-12-31
3,100860,ACE TENNIS RACKET I,100860.0,35.0,28.0,1990-06-01,NaT
4,100860,ACE TENNIS RACKET I,100860.0,32.0,25.6,1990-01-01,1990-05-31
...,...,...,...,...,...,...,...
71,-111111,test2,NaN,NaN,NaN,NaT,NaT
72,-333333,test4,NaN,NaN,NaN,NaT,NaT
73,33333300,test04,NaN,NaN,NaN,NaT,NaT
74,123456,test2 changed,NaN,NaN,NaN,NaT,NaT
75,222222,test3,NaN,NaN,NaN,NaT,NaT

Заметьте, что появились следующие записи

```
58	200381	test	NaN	NaN	NaN	NaT	NaT
59	123456	test2	NaN	NaN	NaN	NaT	NaT
```

для всех строчек левой таблицы для которых не нашлось пары в правой таблице

LEFT JOIN позволяет нам, например, вывести только те продукты о которых нет информации о стоимости

In [ ]:
pd.read_sql_query("""
SELECT * 
FROM da.product
LEFT JOIN da.price
     ON product.product_id = price.product_id
WHERE price.product_id IS NULL
""",conn)

,product_id,description,product_id,list_price,min_price,start_date,end_date
0,1234567,test3,None,None,None,None,None
1,111111,test2,None,None,None,None,None
2,222222,test3,None,None,None,None,None
3,333333,test4,None,None,None,None,None
4,444444,test5,None,None,None,None,None
5,12345678,test3,None,None,None,None,None
6,1234567899,test10,None,None,None,None,None
7,12345679,test9,None,None,None,None,None
8,123456789,test31,None,None,None,None,None
9,555,test555,None,None,None,None,None
10,12345600,test01,None,None,None,None,None
11,33333300,test04,None,None,None,None,None
12,123456,test2 changed,None,None,None,None,None
13,-111111,test2,None,None,None,None,None
14,-222222,test3,None,None,None,None,None
15,-333333,test4,None,None,None,None,None
16,-444444,test5,None,None,None,None,None

Подробная схема работы приведена ниже

In [ ]:
"""
Job
===============
job_id function
===============
667    clerk
900    non-existent job
901    spy

Employee
=====================================
employee_id last_name ... job_id ...
=====================================
7369        smith         667            -> 667 = 667 ? -> True -> соединяем с этой строкой
7876        adams         667            -> 667 = 667 ? -> True -> соединяем с этой строкой
7954        murray        668            -> 668 = 667 ? -> False -> не соединяем с этой строкой

К этим строкам добавятся строки с идентификаторами из таблицы job, которых нет в таблице employee

+
======================================
job.job_id    employee.job_id  
======================================
900           NULL
901           NULL

"""

### RIGHT (OUTER) JOIN
То же что LEFT, но с другой стороны, получится тот же результат что и раньше.

Соединим таблицу product с таблицей price по полю product_id

In [ ]:
pd.read_sql_query("""
SELECT * 
FROM da.price
RIGHT JOIN da.product
     ON product.product_id = price.product_id
""",conn)

    product_id  list_price  ...  product_id                   description
0     100860.0        30.0  ...      100860           ace tennis racket i
1     100860.0        32.0  ...      100860           ace tennis racket i
2     100860.0        35.0  ...      100860           ace tennis racket i
3     100861.0        39.0  ...      100861          ace tennis racket ii
4     100861.0        42.0  ...      100861          ace tennis racket ii
5     100861.0        45.0  ...      100861          ace tennis racket ii
6     100870.0         2.4  ...      100870       ace tennis balls-3 pack
7     100870.0         2.8  ...      100870       ace tennis balls-3 pack
8     100871.0         5.6  ...      100871       ace tennis balls-6 pack
9     100871.0         4.8  ...      100871       ace tennis balls-6 pack
10    100890.0        54.0  ...      100890                ace tennis net
11    100890.0        58.0  ...      100890                ace tennis net
12    101860.0        24.0  ...      101860              sp tennis racket
13    101863.0        12.5  ...      101863              sp junior racket
14    102130.0         3.4  ...      102130         rh: "guide to tennis"
15    200376.0         2.4  ...      200376          sb energy bar-6 pack
16    200380.0         4.0  ...      200380          sb vita snack-6 pack
17    103120.0        25.0  ...      103120           wiff softball bat i
18    103120.0        24.0  ...      103120           wiff softball bat i
19    103120.0        23.2  ...      103120           wiff softball bat i
20    103121.0        30.0  ...      103121          wiff softball bat ii
21    103121.0        28.8  ...      103121          wiff softball bat ii
22    103121.0        27.8  ...      103121          wiff softball bat ii
23    103130.0         4.2  ...      103130          wiff softball, small
24    103130.0         4.0  ...      103130          wiff softball, small
25    103131.0         4.5  ...      103131          wiff softball, large
26    103131.0         4.2  ...      103131          wiff softball, large
27    103140.0        20.0  ...      103140       wiff softball mitt (lh)
28    103141.0        20.0  ...      103141       wiff softball mitt (rh)
29    102132.0         3.4  ...      102132       rh: "guide to softball"
30    104350.0        44.0  ...      104350        dunk basketball indoor
31    104350.0        42.0  ...      104350        dunk basketball indoor
32    104350.0        40.0  ...      104350        dunk basketball indoor
33    104351.0        26.0  ...      104351       dunk basketball outdoor
34    104351.0        24.8  ...      104351       dunk basketball outdoor
35    104351.0        23.6  ...      104351       dunk basketball outdoor
36    104352.0        58.3  ...      104352  dunk basketball professional
37    104352.0        54.0  ...      104352  dunk basketball professional
38    104352.0        50.0  ...      104352  dunk basketball professional
39    104360.0        39.0  ...      104360                     dunk hoop
40    104360.0        36.0  ...      104360                     dunk hoop
41    104361.0        50.0  ...      104361  dunk hoop w/fiberglass board
42    104361.0        47.0  ...      104361  dunk hoop w/fiberglass board
43    104362.0         5.0  ...      104362           dunk nets - rainbow
44    102134.0         3.4  ...      102134     rh: "guide to basketball"
45    105123.0        40.0  ...      105123  yellow jersey bicycle helmet
46    105123.0        37.7  ...      105123  yellow jersey bicycle helmet
47    105123.0        36.3  ...      105123  yellow jersey bicycle helmet
48    105124.0        15.0  ...      105124  yellow jersey bicycle gloves
49    105124.0        12.0  ...      105124  yellow jersey bicycle gloves
50    105124.0        10.0  ...      105124  yellow jersey bicycle gloves
51    105125.0         3.0  ...      105125    yellow jersey water bottle
52    105125.0         2.0  ...      105125    yellow jersey water bottle
53    105126.0         6.0  ...      105126     yellow jersey bottle cage
54    105126.0         5.0  ...      105126     yellow jersey bottle cage
55    105127.0         6.0  ...      105127      yellow jersey frame pump
56    105128.0        10.0  ...      105128     yellow jersey saddle pack
57    102136.0         3.4  ...      102136        rh: "guide to cycling"
58         NaN         NaN  ...      200381                          test
59         NaN         NaN  ...      123456                         test2

[60 rows x 7 columns]

А если не менять местами будут сохранены все product_id из таблицы price

In [ ]:
pd.read_sql_query("""
SELECT * 
FROM da.product
RIGHT JOIN da.price
     ON product.product_id = price.product_id
""",conn)

,product_id,description,product_id,list_price,min_price,start_date,end_date
0,100871,ACE TENNIS BALLS-6 PACK,100871,4.8,3.20,1989-01-01,1989-12-01
1,100890,ACE TENNIS NET,100890,58.0,46.40,1989-01-01,NaT
2,100890,ACE TENNIS NET,100890,54.0,40.50,1988-06-01,1988-12-31
3,100860,ACE TENNIS RACKET I,100860,35.0,28.00,1990-06-01,NaT
4,100860,ACE TENNIS RACKET I,100860,32.0,25.60,1990-01-01,1990-05-31
5,100860,ACE TENNIS RACKET I,100860,30.0,24.00,1989-01-01,1989-12-31
6,100861,ACE TENNIS RACKET II,100861,45.0,36.00,1990-06-01,NaT
7,100861,ACE TENNIS RACKET II,100861,42.0,33.60,1990-01-01,1990-05-31
8,100861,ACE TENNIS RACKET II,100861,39.0,31.20,1989-01-01,1989-12-31
9,100870,ACE TENNIS BALLS-3 PACK,100870,2.8,2.40,1990-01-01,NaT
10,100870,ACE TENNIS BALLS-3 PACK,100870,2.4,1.90,1989-01-01,1989-12-01
11,100871,ACE TENNIS BALLS-6 PACK,100871,5.6,4.80,1990-01-01,NaT
12,101860,SP TENNIS RACKET,101860,24.0,18.00,1989-02-15,NaT
13,101863,SP JUNIOR RACKET,101863,12.5,9.40,1989-02-15,NaT
14,102130,"RH: ""GUIDE TO TENNIS""",102130,3.4,2.80,1989-08-18,NaT
15,200376,SB ENERGY BAR-6 PACK,200376,2.4,1.75,1990-11-15,NaT
16,200380,SB VITA SNACK-6 PACK,200380,4.0,3.20,1990-11-15,NaT
17,103120,WIFF SOFTBALL BAT I,103120,23.2,18.60,1989-01-01,1989-12-31
18,103120,WIFF SOFTBALL BAT I,103120,24.0,19.20,1990-01-01,1990-05-31
19,103120,WIFF SOFTBALL BAT I,103120,25.0,20.00,1990-06-01,NaT
20,103121,WIFF SOFTBALL BAT II,103121,27.8,22.30,1989-01-01,1989-12-31
21,103121,WIFF SOFTBALL BAT II,103121,28.8,23.00,1990-01-01,1990-05-31
22,103121,WIFF SOFTBALL BAT II,103121,30.0,24.00,1990-06-01,NaT
23,103130,"WIFF SOFTBALL, SMALL",103130,4.0,3.50,1989-01-01,1989-12-31
24,103130,"WIFF SOFTBALL, SMALL",103130,4.2,3.60,1990-01-01,NaT
25,103131,"WIFF SOFTBALL, LARGE",103131,4.2,3.60,1989-01-01,1989-12-31
26,103131,"WIFF SOFTBALL, LARGE",103131,4.5,3.90,1990-01-01,NaT
27,103140,WIFF SOFTBALL MITT (LH),103140,20.0,15.00,1989-02-15,NaT
28,103141,WIFF SOFTBALL MITT (RH),103141,20.0,15.00,1989-02-15,NaT
29,102132,"RH: ""GUIDE TO SOFTBALL""",102132,3.4,2.80,1989-08-18,NaT
30,104350,DUNK BASKETBALL INDOOR,104350,40.0,32.00,1989-01-01,1989-12-31
31,104350,DUNK BASKETBALL INDOOR,104350,42.0,33.60,1990-01-01,1990-05-31
32,104350,DUNK BASKETBALL INDOOR,104350,44.0,35.30,1990-06-01,NaT
33,104351,DUNK BASKETBALL OUTDOOR,104351,23.6,18.90,1989-01-01,1989-12-31
34,104351,DUNK BASKETBALL OUTDOOR,104351,24.8,19.80,1990-01-01,1990-05-31
35,104351,DUNK BASKETBALL OUTDOOR,104351,26.0,20.80,1990-06-01,NaT
36,104352,DUNK BASKETBALL PROFESSIONAL,104352,50.0,35.00,1989-01-01,1989-12-31
37,104352,DUNK BASKETBALL PROFESSIONAL,104352,54.0,37.80,1990-01-01,1990-05-31
38,104352,DUNK BASKETBALL PROFESSIONAL,104352,58.3,40.80,1990-06-01,NaT
39,104360,DUNK HOOP,104360,36.0,29.50,1989-01-01,1989-12-31
40,104360,DUNK HOOP,104360,39.0,32.00,1990-01-01,NaT
41,104361,DUNK HOOP W/FIBERGLASS BOARD,104361,47.0,33.00,1989-01-01,1989-12-31
42,104361,DUNK HOOP W/FIBERGLASS BOARD,104361,50.0,35.00,1990-01-01,NaT
43,104362,DUNK NETS - RAINBOW,104362,5.0,4.00,1989-02-15,NaT
44,102134,"RH: ""GUIDE TO BASKETBALL""",102134,3.4,2.80,1989-08-18,NaT
45,105123,YELLOW JERSEY BICYCLE HELMET,105123,36.3,29.00,1989-01-01,1989-12-31
46,105123,YELLOW JERSEY BICYCLE HELMET,105123,37.7,32.00,1990-01-01,1990-05-31
47,105123,YELLOW JERSEY BICYCLE HELMET,105123,40.0,34.00,1990-06-01,NaT
48,105124,YELLOW JERSEY BICYCLE GLOVES,105124,10.0,7.60,1989-01-01,1989-12-31
49,105124,YELLOW JERSEY BICYCLE GLOVES,105124,12.0,9.00,1990-01-01,1990-05-31
50,105124,YELLOW JERSEY BICYCLE GLOVES,105124,15.0,10.00,1990-06-01,NaT
51,105125,YELLOW JERSEY WATER BOTTLE,105125,2.0,1.70,1989-01-01,1989-12-31
52,105125,YELLOW JERSEY WATER BOTTLE,105125,3.0,2.60,1990-01-01,NaT
53,105126,YELLOW JERSEY BOTTLE CAGE,105126,5.0,4.30,1989-01-01,1989-12-31
54,105126,YELLOW JERSEY BOTTLE CAGE,105126,6.0,5.00,1990-01-01,NaT
55,105127,YELLOW JERSEY FRAME PUMP,105127,6.0,5.00,1990-11-15,NaT
56,105128,YELLOW JERSEY SADDLE PACK,105128,10.0,8.00,1990-11-15,NaT
57,102136,"RH: ""GUIDE TO CYCLING""",102136,3.4,2.80,1989-08-18,NaT
58,11111100,test02,11111100,10.0,9.00,2020-10-20,NaT

### FULL OUTER JOIN
FULL OUTER JOIN объеденяет результаты LEFT и RIGHT JOIN-а в для случаев отсутствующих значений в левой или правой таблице.

In [ ]:
pd.read_sql_query("""
/*SELECT
    *
FROM da.product as t1
FULL JOIN da.price as t2
  ON t1.product_id = t2.product_id
*/

-- CTE
with job_t_1 as (
  select job_id, function from da.job
),
job_t_2 as (
  select job_id + 0.5 as new_job_id, concat(function, ' ', 'NEW') as function_new
  from da.job
)
select *
from job_t_1 as t1
full join job_t_2 as t2
on t1.job_id = t2.new_job_id
order by 1 , 3 desc
--select job_id, function, job_id + 1 as new_job_id, concat(function, ' ', 'NEW') as function from da.job

""", conn)

    job_id     function  new_job_id     function_new
0    667.0        CLERK         NaN             None
1    668.0        STAFF         NaN             None
2    669.0      ANALYST         NaN             None
3    670.0  SALESPERSON         NaN             None
4    671.0      MANAGER         NaN             None
5    672.0    PRESIDENT         NaN             None
6      NaN         None       672.5    PRESIDENT NEW
7      NaN         None       671.5      MANAGER NEW
8      NaN         None       670.5  SALESPERSON NEW
9      NaN         None       669.5      ANALYST NEW
10     NaN         None       668.5        STAFF NEW
11     NaN         None       667.5        CLERK NEW

### Соединение нескольких таблиц (больше 2)
Соединение нескольких таблиц делается весьма прямолинейно, единственное обратите внимание, что условие ON идет после каждого выражения JOIN. В других субд, например, mysql, можно встретить выражения вида


```
SELECT
  *
FROM
  a
  INNER JOIN
  b
  INNER JOIN
  c
  ON a.id = b.id AND b.id = c.id
```
Но в postgresql это не работает, и тот же код переписывается вот так:
```
SELECT
  *
FROM
  a
  INNER JOIN
  b
  ON a.id = b.id
  INNER JOIN
  c
  ON b.id = c.id
```

In [ ]:
pd.read_sql_query("""
SELECT
    employee.*, '|', job.*, '|', department.*
FROM da.employee 
INNER JOIN da.job
  ON employee.job_id = job.job_id
INNER JOIN da.department
  ON employee.department_id = department.department_id
""", conn)

,employee_id,last_name,first_name,middle_initial,manager_id,job_id,hire_date,salary,commission,department_id,?column?,job_id,function,?column?,department_id,name,location_id
0,7369,SMITH,JOHN,Q,7902.0,667,1984-12-17,800.0,NaN,20,|,667,CLERK,|,20,RESEARCH,124
1,7499,ALLEN,KEVIN,J,7698.0,670,1985-02-20,1600.0,300.0,30,|,670,SALESPERSON,|,30,SALES,123
2,7505,DOYLE,JEAN,K,7839.0,671,1985-04-04,2850.0,NaN,13,|,671,MANAGER,|,13,SALES,122
3,7506,DENNIS,LYNN,S,7839.0,671,1985-05-15,2750.0,NaN,23,|,671,MANAGER,|,23,SALES,124
4,7507,BAKER,LESLIE,D,7839.0,671,1985-06-10,2200.0,NaN,14,|,671,MANAGER,|,14,OPERATIONS,122
5,7521,WARD,CYNTHIA,D,7698.0,670,1985-02-22,1250.0,500.0,30,|,670,SALESPERSON,|,30,SALES,123
6,7555,PETERS,DANIEL,T,7505.0,670,1985-03-31,1250.0,300.0,13,|,670,SALESPERSON,|,13,SALES,122
7,7557,SHAW,KAREN,P,7505.0,670,1985-04-02,1250.0,1200.0,13,|,670,SALESPERSON,|,13,SALES,122
8,7560,DUNCAN,SARAH,S,7506.0,670,1985-05-31,1250.0,NaN,23,|,670,SALESPERSON,|,23,SALES,124
9,7564,LANGE,GREGORY,J,7506.0,670,1985-06-01,1250.0,300.0,23,|,670,SALESPERSON,|,23,SALES,124
10,7566,JONES,TERRY,M,7839.0,671,1985-04-02,2975.0,NaN,20,|,671,MANAGER,|,20,RESEARCH,124
11,7569,ALBERTS,CHRIS,L,7839.0,671,1985-04-06,3000.0,NaN,12,|,671,MANAGER,|,12,RESEARCH,122
12,7600,PORTER,RAYMOND,Y,7505.0,670,1985-04-15,1250.0,900.0,13,|,670,SALESPERSON,|,13,SALES,122
13,7609,LEWIS,RICHARD,M,7507.0,668,1985-04-16,1800.0,NaN,24,|,668,STAFF,|,24,OPERATIONS,124
14,7654,MARTIN,KENNETH,J,7698.0,670,1985-09-28,1250.0,1400.0,30,|,670,SALESPERSON,|,30,SALES,123
15,7676,SOMMERS,DENISE,D,7507.0,668,1985-04-19,1850.0,NaN,34,|,668,STAFF,|,34,OPERATIONS,123
16,7698,BLAKE,MARION,S,7839.0,671,1985-05-01,2850.0,NaN,30,|,671,MANAGER,|,30,SALES,123
17,7782,CLARK,CAROL,F,7839.0,671,1985-06-09,2450.0,NaN,10,|,671,MANAGER,|,10,ACCOUNTING,122
18,7788,SCOTT,DONALD,T,7566.0,669,1986-12-09,3000.0,NaN,20,|,669,ANALYST,|,20,RESEARCH,124
19,7789,WEST,LIVIA,N,7506.0,670,1985-04-04,1500.0,1000.0,23,|,670,SALESPERSON,|,23,SALES,124
20,7799,FISHER,MATTHEW,G,7569.0,669,1986-12-12,3000.0,NaN,12,|,669,ANALYST,|,12,RESEARCH,122
21,7820,ROSS,PAUL,S,7505.0,670,1985-06-01,1300.0,800.0,43,|,670,SALESPERSON,|,43,SALES,167
22,7839,KING,FRANCIS,A,NaN,672,1985-11-17,5000.0,NaN,10,|,672,PRESIDENT,|,10,ACCOUNTING,122
23,7844,TURNER,MARY,A,7698.0,670,1985-09-08,1500.0,0.0,30,|,670,SALESPERSON,|,30,SALES,123
24,7876,ADAMS,DIANE,G,7788.0,667,1987-01-12,1100.0,NaN,20,|,667,CLERK,|,20,RESEARCH,124
25,7900,JAMES,FRED,S,7698.0,667,1985-12-03,950.0,NaN,30,|,667,CLERK,|,30,SALES,123
26,7902,FORD,JENNIFER,D,7566.0,669,1985-12-03,3000.0,NaN,20,|,669,ANALYST,|,20,RESEARCH,124
27,7916,ROBERTS,GRACE,M,7569.0,669,1987-01-04,2875.0,NaN,12,|,669,ANALYST,|,12,RESEARCH,122
28,7919,DOUGLAS,MICHAEL,A,7799.0,667,1987-01-04,800.0,NaN,12,|,667,CLERK,|,12,RESEARCH,122
29,7934,MILLER,BARBARA,M,7782.0,667,1986-01-23,1300.0,NaN,10,|,667,CLERK,|,10,ACCOUNTING,122
30,7950,JENSEN,ALICE,B,7505.0,667,1987-01-15,750.0,NaN,13,|,667,CLERK,|,13,SALES,122
31,7954,MURRAY,JAMES,T,7506.0,667,1987-01-16,750.0,NaN,23,|,667,CLERK,|,23,SALES,124

# UNION
Объединяет результат двух запросов, при этом их проекции должны совпадать.

Есть дополнительная команда UNION ALL, которая оставит нам дубликаты (т.е сделает соединение без какой-либо дополнительной обработки значений).

In [ ]:
pd.read_sql_query("""
SELECT 
    *
FROM da.product as t1
LEFT JOIN da.price as t2
    ON t1.product_id = t2.product_id
UNION ALL
SELECT 
    *
FROM da.product as t1
RIGHT JOIN da.price as t2
    ON t1.product_id = t2.product_id
""", conn)

,product_id,description,product_id,list_price,min_price,start_date,end_date
0,100871,ACE TENNIS BALLS-6 PACK,100871.0,4.8,3.2,1989-01-01,1989-12-01
1,100890,ACE TENNIS NET,100890.0,58.0,46.4,1989-01-01,NaT
2,100890,ACE TENNIS NET,100890.0,54.0,40.5,1988-06-01,1988-12-31
3,100860,ACE TENNIS RACKET I,100860.0,35.0,28.0,1990-06-01,NaT
4,100860,ACE TENNIS RACKET I,100860.0,32.0,25.6,1990-01-01,1990-05-31
...,...,...,...,...,...,...,...
130,105126,YELLOW JERSEY BOTTLE CAGE,105126.0,6.0,5.0,1990-01-01,NaT
131,105127,YELLOW JERSEY FRAME PUMP,105127.0,6.0,5.0,1990-11-15,NaT
132,105128,YELLOW JERSEY SADDLE PACK,105128.0,10.0,8.0,1990-11-15,NaT
133,102136,"RH: ""GUIDE TO CYCLING""",102136.0,3.4,2.8,1989-08-18,NaT
134,11111100,test02,11111100.0,10.0,9.0,2020-10-20,NaT

А вот для сравнения обычный UNION.

In [ ]:
pd.read_sql_query("""
 SELECT 
    *
FROM da.product as t1
LEFT JOIN da.price as t2
    ON t1.product_id = t2.product_id
UNION
SELECT 
    *
FROM da.product as t1
RIGHT JOIN da.price as t2
    ON t1.product_id = t2.product_id
""", conn)

,product_id,description,product_id,list_price,min_price,start_date,end_date
0,105126,YELLOW JERSEY BOTTLE CAGE,105126.0,5.0,4.30,1989-01-01,1989-12-31
1,555,test555,NaN,NaN,NaN,NaT,NaT
2,105127,YELLOW JERSEY FRAME PUMP,105127.0,6.0,5.00,1990-11-15,NaT
3,103130,"WIFF SOFTBALL, SMALL",103130.0,4.2,3.60,1990-01-01,NaT
4,222222,test3,NaN,NaN,NaN,NaT,NaT
...,...,...,...,...,...,...,...
71,105124,YELLOW JERSEY BICYCLE GLOVES,105124.0,12.0,9.00,1990-01-01,1990-05-31
72,103121,WIFF SOFTBALL BAT II,103121.0,30.0,24.00,1990-06-01,NaT
73,104351,DUNK BASKETBALL OUTDOOR,104351.0,23.6,18.90,1989-01-01,1989-12-31
74,103130,"WIFF SOFTBALL, SMALL",103130.0,4.0,3.50,1989-01-01,1989-12-31
75,200376,SB ENERGY BAR-6 PACK,200376.0,2.4,1.75,1990-11-15,NaT

С помощью UNION-а мы можем представить FULL OUTER JOIN:

In [ ]:
pd.read_sql_query("""
SELECT 
    t1.product_id,
    t1.description,
    t2.product_id,
    t2.list_price,
    t2.min_price,
    t2.start_date,
    t2.end_date
FROM da.product as t1
LEFT JOIN da.price as t2
    ON t1.product_id = t2.product_id
UNION
SELECT 
    t1.product_id,
    t1.description,
    t2.product_id,
    t2.list_price,
    t2.min_price,
    t2.start_date,
    t2.end_date
FROM da.product as t1
RIGHT JOIN da.price as t2
    ON t1.product_id = t2.product_id
""", conn)

Посмотрите также на разницу более детально на следующих искусственных примерах, обратите внимание на повторы.

In [ ]:
pd.read_sql_query("""
SELECT SUBSTR(function, 2,2), 1 FROM da.job
""",conn)

  substr  ?column?
0     LE         1
1     TA         1
2     NA         1
3     AL         1
4     AN         1
5     RE         1

In [ ]:
pd.read_sql_query("""
SELECT 1 FROM da.job
""",conn)

   ?column?
0         1
1         1
2         1
3         1
4         1
5         1

In [ ]:
pd.read_sql_query("""
SELECT 2 FROM da.job
""",conn)

   ?column?
0         2
1         2
2         2
3         2
4         2
5         2

In [ ]:
pd.read_sql_query("""
SELECT 1 
UNION ALL
SELECT 1 
""",conn) # реузльтат 12 строчек, не убираются дубликаты

   ?column?
0         1
1         1

In [ ]:
pd.read_sql_query("""
SELECT 1 
UNION 
SELECT 1 
""",conn) # убрали все дубликаты

   ?column?
0         1

In [ ]:
pd.read_sql_query("""
SELECT 1 FROM da.job
UNION
SELECT 2 FROM da.job
""",conn) # выводит 1 и 2, дубликаты убираются

   ?column?
0         2
1         1

In [ ]:
# пояснение, мы на самом деле можем выводить константы вместо колонок, или какое-нибудь выражение, которое вычисляется по колонкам
pd.read_sql_query("""
SELECT 1 as "one" FROM da.job
""",conn)

   one
0    1
1    1
2    1
3    1
4    1
5    1

# Подзапросы
Информация про подзапросы на сайте [postgrespro](https://postgrespro.ru/docs/postgrespro/10/functions-subquery)

In [ ]:
pd.read_sql_query("""
SELECT AVG(total) as mean_order FROM da.sales_order
""",conn)

   mean_order
0   2372.3675

Декартово произведение таблицы sales_order с единственным объектом таблицы t_mean, полученной подзапросом

In [ ]:
pd.read_sql_query("""
SELECT
    *
FROM sales_order
inner join (SELECT AVG(total) as mean_order FROM da.sales_order) as t_mean
on 1=1
""", conn)

    order_id order_date  customer_id  ship_date   total  mean_order
0        610 1991-01-07          101 1991-01-08   101.4   2372.3675
1        611 1991-01-11          102 1991-01-11    45.0   2372.3675
2        612 1991-01-15          104 1991-01-20  5860.0   2372.3675
3        601 1990-05-01          106 1990-05-30    60.8   2372.3675
4        602 1990-06-05          102 1990-06-20    56.0   2372.3675
..       ...        ...          ...        ...     ...         ...
95       530 1990-04-03          208 1990-04-07  3026.5   2372.3675
96       545 1990-10-06          208 1990-10-13   475.0   2372.3675
97       557 1991-03-08          208 1991-03-12  2461.8   2372.3675
98       546 1990-10-17          208 1990-10-23  3663.0   2372.3675
99       510 1989-07-18          208 1989-07-21  1336.6   2372.3675

[100 rows x 6 columns]

Так, мы можем посчитать отклонение от среднего ордера

In [ ]:
pd.read_sql_query("""
SELECT
    order_id,
    total,
    total - t_mean.mean_order AS delta
FROM da.sales_order
inner join (SELECT AVG(total) as mean_order FROM da.sales_order) as t_mean
on 1=1
""", conn)

    order_id   total      delta
0        610   101.4 -2270.9675
1        611    45.0 -2327.3675
2        612  5860.0  3487.6325
3        601    60.8 -2311.5675
4        602    56.0 -2316.3675
..       ...     ...        ...
95       530  3026.5   654.1325
96       545   475.0 -1897.3675
97       557  2461.8    89.4325
98       546  3663.0  1290.6325
99       510  1336.6 -1035.7675

[100 rows x 3 columns]

Но можно оформить это и так, подзапросы можно указывать и в самой проекции при условии, что возвращается ровно одно число.

In [ ]:
pd.read_sql_query("""
SELECT
    (SELECT AVG(total) as mean_order FROM da.sales_order) AS average,
    order_id,
    total,
    total - (SELECT AVG(total) as mean_order FROM da.sales_order) AS "delta"
  FROM da.sales_order
""", conn)

      average  order_id   total      delta
0   2372.3675       610   101.4 -2270.9675
1   2372.3675       611    45.0 -2327.3675
2   2372.3675       612  5860.0  3487.6325
3   2372.3675       601    60.8 -2311.5675
4   2372.3675       602    56.0 -2316.3675
..        ...       ...     ...        ...
95  2372.3675       530  3026.5   654.1325
96  2372.3675       545   475.0 -1897.3675
97  2372.3675       557  2461.8    89.4325
98  2372.3675       546  3663.0  1290.6325
99  2372.3675       510  1336.6 -1035.7675

[100 rows x 4 columns]

Можно также использовать подзапросы прямо во внешнем условии WHERE.

Например, мы можем выбрать все ордера у которых значение total будет больше среднего

In [ ]:
pd.read_sql_query("""
SELECT
  *
FROM da.sales_order
WHERE
  total > (SELECT AVG(total) FROM da.sales_order)
""",conn)

    order_id order_date  customer_id  ship_date    total
0        612 1991-01-15          104 1991-01-20   5860.0
1        605 1990-07-14          106 1990-07-30   8374.0
2        620 1991-03-12          100 1991-03-12   4450.0
3        613 1991-02-01          108 1991-02-01   6400.0
4        614 1991-02-01          102 1991-02-05  23940.0
5        617 1991-02-05          105 1991-03-03  46370.0
6        618 1991-02-15          102 1991-03-06   3083.0
7        553 1991-02-02          228 1991-02-13   4400.0
8        526 1990-03-04          221 1990-03-07   7700.0
9        543 1990-09-04          221 1990-09-07   8400.0
10       555 1991-03-04          221 1991-03-07   8540.0
11       528 1990-03-24          224 1990-03-24   3770.0
12       565 1991-06-01          227 1991-06-03   4900.0
13       518 1989-10-20          201 1989-11-05   2932.5
14       542 1990-08-11          208 1990-08-23   2409.0
15       566 1991-06-09          201 1991-06-12   3389.2
16       527 1990-02-27          204 1990-03-14   3054.4
17       522 1990-01-07          204 1990-01-10   2578.8
18       561 1991-04-20          207 1991-05-07   2558.3
19       506 1989-04-27          208 1989-05-10   2600.4
20       530 1990-04-03          208 1990-04-07   3026.5
21       557 1991-03-08          208 1991-03-12   2461.8
22       546 1990-10-17          208 1990-10-23   3663.0

Обратим внимание, что вот такой вариант уже работать не будет, поскольку агрегационные функции не могут применяться в проверке условий в процессе поиска.

In [ ]:
pd.read_sql_query("""

  SELECT
    order_id,
    total
  FROM da.sales_order
  WHERE
    total > AVG(total)

""",conn)

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 0))

DatabaseError: ignored

Если запрос возвращает одну колонку, но несколько значений, мы можем во внешнем запросе проверить присутствие значений колонки в списке, полученном с помощью подзапроса.

Выбрать все ордера из таблицы sales_order в которых присутствует item_id = 4

In [ ]:
# вар 1 IN + подзапрос
pd.read_sql_query("""
SELECT DISTINCT
  order_id
FROM da.sales_order
WHERE order_id IN (SELECT order_id FROM da.item WHERE item_id=4)
""",conn)

    order_id
0        576
1        605
2        617
3        546
4        524
5        616
6        550
7        544
8        559
9        619
10       561
11       552
12       547
13       518
14       613
15       530
16       571
17       542
18       549
19       566
20       551
21       557
22       522
23       612

In [ ]:
# вар 2
# через join 
pd.read_sql_query("""
SELECT DISTINCT
 sales_order.order_id
FROM da.sales_order
INNER JOIN da.item
  ON sales_order.order_id = item.order_id
WHERE item.item_id = 4
""",conn)

    order_id
0        576
1        605
2        617
3        546
4        524
5        616
6        550
7        544
8        559
9        619
10       561
11       552
12       547
13       518
14       613
15       530
16       571
17       542
18       549
19       566
20       551
21       557
22       522
23       612

Есть и другие специальные возможности, связанные с подзапросами, например, операция EXISTS описана [здесь](https://postgrespro.ru/docs/postgrespro/10/functions-subquery)